{"cells":[{"cell_type":"code","execution_count":1,"metadata":{"executionInfo":{"elapsed":1111,"status":"ok","timestamp":1729819628979,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"},"user_tz":-540},"id":"aNur4_6mOPfX"},"outputs":[],"source":["import os\n","os.chdir('/content/drive/MyDrive/000GithubRepos/bigcontest2024')"]},{"cell_type":"code","execution_count":2,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":3875,"status":"ok","timestamp":1729819633799,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"},"user_tz":-540},"id":"eeHZyCQlWuuM","outputId":"e085ff91-d44c-4711-c416-bc9b70e23525"},"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting python-dotenv\n","  Downloading python_dotenv-1.0.1-py3-none-any.whl.metadata (23 kB)\n","Downloading python_dotenv-1.0.1-py3-none-any.whl (19 kB)\n","Installing collected packages: python-dotenv\n","Successfully installed python-dotenv-1.0.1\n"]}],"source":["pip install python-dotenv"]},{"cell_type":"code","execution_count":3,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":16145,"status":"ok","timestamp":1729819649939,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"},"user_tz":-540},"id":"BbCZyeCoW4nT","outputId":"8f172983-fcc7-4ed2-c634-158cc68e3930"},"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting langchain_community\n","  Downloading langchain_community-0.3.3-py3-none-any.whl.metadata (2.8 kB)\n","Requirement already satisfied: PyYAML>=5.3 in /usr/local/lib/python3.10/dist-packages (from langchain_community) (6.0.2)\n","Requirement already satisfied: SQLAlchemy<3,>=1.4 in /usr/local/lib/python3.10/dist-packages (from langchain_community) (2.0.36)\n","Requirement already satisfied: aiohttp<4.0.0,>=3.8.3 in /usr/local/lib/python3.10/dist-packages (from langchain_community) (3.10.10)\n","Collecting dataclasses-json<0.7,>=0.5.7 (from langchain_community)\n","  Downloading dataclasses_json-0.6.7-py3-none-any.whl.metadata (25 kB)\n","Collecting langchain<0.4.0,>=0.3.4 (from langchain_community)\n","  Downloading langchain-0.3.4-py3-none-any.whl.metadata (7.1 kB)\n","Collecting langchain-core<0.4.0,>=0.3.12 (from langchain_community)\n","  Downloading langchain_core-0.3.12-py3-none-any.whl.metadata (6.3 kB)\n","Collecting langsmith<0.2.0,>=0.1.125 (from langchain_community)\n","  Downloading langsmith-0.1.137-py3-none-any.whl.metadata (13 kB)\n","Requirement already satisfied: numpy<2,>=1 in /usr/local/lib/python3.10/dist-packages (from langchain_community) (1.26.4)\n","Collecting pydantic-settings<3.0.0,>=2.4.0 (from langchain_community)\n","  Downloading pydantic_settings-2.6.0-py3-none-any.whl.metadata (3.5 kB)\n","Requirement already satisfied: requests<3,>=2 in /usr/local/lib/python3.10/dist-packages (from langchain_community) (2.32.3)\n","Requirement already satisfied: tenacity!=8.4.0,<10,>=8.1.0 in /usr/local/lib/python3.10/dist-packages (from langchain_community) (9.0.0)\n","Requirement already satisfied: aiohappyeyeballs>=2.3.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain_community) (2.4.3)\n","Requirement already satisfied: aiosignal>=1.1.2 in /usr/local/lib/python3.10/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain_community) (1.3.1)\n","Requirement already satisfied: attrs>=17.3.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain_community) (24.2.0)\n","Requirement already satisfied: frozenlist>=1.1.1 in /usr/local/lib/python3.10/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain_community) (1.4.1)\n","Requirement already satisfied: multidict<7.0,>=4.5 in /usr/local/lib/python3.10/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain_community) (6.1.0)\n","Requirement already satisfied: yarl<2.0,>=1.12.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain_community) (1.16.0)\n","Requirement already satisfied: async-timeout<5.0,>=4.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain_community) (4.0.3)\n","Collecting marshmallow<4.0.0,>=3.18.0 (from dataclasses-json<0.7,>=0.5.7->langchain_community)\n","  Downloading marshmallow-3.23.0-py3-none-any.whl.metadata (7.6 kB)\n","Collecting typing-inspect<1,>=0.4.0 (from dataclasses-json<0.7,>=0.5.7->langchain_community)\n","  Downloading typing_inspect-0.9.0-py3-none-any.whl.metadata (1.5 kB)\n","Collecting langchain-text-splitters<0.4.0,>=0.3.0 (from langchain<0.4.0,>=0.3.4->langchain_community)\n","  Downloading langchain_text_splitters-0.3.0-py3-none-any.whl.metadata (2.3 kB)\n","Requirement already satisfied: pydantic<3.0.0,>=2.7.4 in /usr/local/lib/python3.10/dist-packages (from langchain<0.4.0,>=0.3.4->langchain_community) (2.9.2)\n","Collecting jsonpatch<2.0,>=1.33 (from langchain-core<0.4.0,>=0.3.12->langchain_community)\n","  Downloading jsonpatch-1.33-py2.py3-none-any.whl.metadata (3.0 kB)\n","Requirement already satisfied: packaging<25,>=23.2 in /usr/local/lib/python3.10/dist-packages (from langchain-core<0.4.0,>=0.3.12->langchain_community) (24.1)\n","Requirement already satisfied: typing-extensions>=4.7 in /usr/local/lib/python3.10/dist-packages (from langchain-core<0.4.0,>=0.3.12->langchain_community) (4.12.2)\n","Collecting httpx<1,>=0.23.0 (from langsmith<0.2.0,>=0.1.125->langchain_community)\n","  Downloading httpx-0.27.2-py3-none-any.whl.metadata (7.1 kB)\n","Collecting orjson<4.0.0,>=3.9.14 (from langsmith<0.2.0,>=0.1.125->langchain_community)\n","  Downloading orjson-3.10.10-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (50 kB)\n","\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m50.6/50.6 kB\u001b[0m \u001b[31m2.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hCollecting requests-toolbelt<2.0.0,>=1.0.0 (from langsmith<0.2.0,>=0.1.125->langchain_community)\n","  Downloading requests_toolbelt-1.0.0-py2.py3-none-any.whl.metadata (14 kB)\n","Requirement already satisfied: python-dotenv>=0.21.0 in /usr/local/lib/python3.10/dist-packages (from pydantic-settings<3.0.0,>=2.4.0->langchain_community) (1.0.1)\n","Requirement already satisfied: charset-normalizer<4,>=2 in /usr/local/lib/python3.10/dist-packages (from requests<3,>=2->langchain_community) (3.4.0)\n","Requirement already satisfied: idna<4,>=2.5 in /usr/local/lib/python3.10/dist-packages (from requests<3,>=2->langchain_community) (3.10)\n","Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.10/dist-packages (from requests<3,>=2->langchain_community) (2.2.3)\n","Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.10/dist-packages (from requests<3,>=2->langchain_community) (2024.8.30)\n","Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from SQLAlchemy<3,>=1.4->langchain_community) (3.1.1)\n","Requirement already satisfied: anyio in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain_community) (3.7.1)\n","Collecting httpcore==1.* (from httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain_community)\n","  Downloading httpcore-1.0.6-py3-none-any.whl.metadata (21 kB)\n","Requirement already satisfied: sniffio in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain_community) (1.3.1)\n","Collecting h11<0.15,>=0.13 (from httpcore==1.*->httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain_community)\n","  Downloading h11-0.14.0-py3-none-any.whl.metadata (8.2 kB)\n","Collecting jsonpointer>=1.9 (from jsonpatch<2.0,>=1.33->langchain-core<0.4.0,>=0.3.12->langchain_community)\n","  Downloading jsonpointer-3.0.0-py2.py3-none-any.whl.metadata (2.3 kB)\n","Requirement already satisfied: annotated-types>=0.6.0 in /usr/local/lib/python3.10/dist-packages (from pydantic<3.0.0,>=2.7.4->langchain<0.4.0,>=0.3.4->langchain_community) (0.7.0)\n","Requirement already satisfied: pydantic-core==2.23.4 in /usr/local/lib/python3.10/dist-packages (from pydantic<3.0.0,>=2.7.4->langchain<0.4.0,>=0.3.4->langchain_community) (2.23.4)\n","Collecting mypy-extensions>=0.3.0 (from typing-inspect<1,>=0.4.0->dataclasses-json<0.7,>=0.5.7->langchain_community)\n","  Downloading mypy_extensions-1.0.0-py3-none-any.whl.metadata (1.1 kB)\n","Requirement already satisfied: propcache>=0.2.0 in /usr/local/lib/python3.10/dist-packages (from yarl<2.0,>=1.12.0->aiohttp<4.0.0,>=3.8.3->langchain_community) (0.2.0)\n","Requirement already satisfied: exceptiongroup in /usr/local/lib/python3.10/dist-packages (from anyio->httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain_community) (1.2.2)\n","Downloading langchain_community-0.3.3-py3-none-any.whl (2.4 MB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m2.4/2.4 MB\u001b[0m \u001b[31m36.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading dataclasses_json-0.6.7-py3-none-any.whl (28 kB)\n","Downloading langchain-0.3.4-py3-none-any.whl (1.0 MB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m1.0/1.0 MB\u001b[0m \u001b[31m48.9 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading langchain_core-0.3.12-py3-none-any.whl (407 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m407.7/407.7 kB\u001b[0m \u001b[31m26.3 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading langsmith-0.1.137-py3-none-any.whl (296 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m296.9/296.9 kB\u001b[0m \u001b[31m20.8 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading pydantic_settings-2.6.0-py3-none-any.whl (28 kB)\n","Downloading httpx-0.27.2-py3-none-any.whl (76 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m76.4/76.4 kB\u001b[0m \u001b[31m5.8 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading httpcore-1.0.6-py3-none-any.whl (78 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m78.0/78.0 kB\u001b[0m \u001b[31m5.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading jsonpatch-1.33-py2.py3-none-any.whl (12 kB)\n","Downloading langchain_text_splitters-0.3.0-py3-none-any.whl (25 kB)\n","Downloading marshmallow-3.23.0-py3-none-any.whl (49 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m49.5/49.5 kB\u001b[0m \u001b[31m3.8 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading orjson-3.10.10-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (144 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m144.5/144.5 kB\u001b[0m \u001b[31m11.1 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading requests_toolbelt-1.0.0-py2.py3-none-any.whl (54 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m54.5/54.5 kB\u001b[0m \u001b[31m4.0 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading typing_inspect-0.9.0-py3-none-any.whl (8.8 kB)\n","Downloading jsonpointer-3.0.0-py2.py3-none-any.whl (7.6 kB)\n","Downloading mypy_extensions-1.0.0-py3-none-any.whl (4.7 kB)\n","Downloading h11-0.14.0-py3-none-any.whl (58 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m58.3/58.3 kB\u001b[0m \u001b[31m4.5 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hInstalling collected packages: orjson, mypy-extensions, marshmallow, jsonpointer, h11, typing-inspect, requests-toolbelt, jsonpatch, httpcore, pydantic-settings, httpx, dataclasses-json, langsmith, langchain-core, langchain-text-splitters, langchain, langchain_community\n","Successfully installed dataclasses-json-0.6.7 h11-0.14.0 httpcore-1.0.6 httpx-0.27.2 jsonpatch-1.33 jsonpointer-3.0.0 langchain-0.3.4 langchain-core-0.3.12 langchain-text-splitters-0.3.0 langchain_community-0.3.3 langsmith-0.1.137 marshmallow-3.23.0 mypy-extensions-1.0.0 orjson-3.10.10 pydantic-settings-2.6.0 requests-toolbelt-1.0.0 typing-inspect-0.9.0\n"]}],"source":["pip install langchain_community"]},{"cell_type":"code","execution_count":4,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":9061,"status":"ok","timestamp":1729819658994,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"},"user_tz":-540},"id":"Wj3Gf_UbXJuL","outputId":"0c6c8882-ea23-4a2a-dfb7-cc28fe78c575"},"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting sentence-transformers\n","  Downloading sentence_transformers-3.2.1-py3-none-any.whl.metadata (10 kB)\n","Requirement already satisfied: transformers<5.0.0,>=4.41.0 in /usr/local/lib/python3.10/dist-packages (from sentence-transformers) (4.44.2)\n","Requirement already satisfied: tqdm in /usr/local/lib/python3.10/dist-packages (from sentence-transformers) (4.66.5)\n","Requirement already satisfied: torch>=1.11.0 in /usr/local/lib/python3.10/dist-packages (from sentence-transformers) (2.5.0+cu121)\n","Requirement already satisfied: scikit-learn in /usr/local/lib/python3.10/dist-packages (from sentence-transformers) (1.5.2)\n","Requirement already satisfied: scipy in /usr/local/lib/python3.10/dist-packages (from sentence-transformers) (1.13.1)\n","Requirement already satisfied: huggingface-hub>=0.20.0 in /usr/local/lib/python3.10/dist-packages (from sentence-transformers) (0.24.7)\n","Requirement already satisfied: Pillow in /usr/local/lib/python3.10/dist-packages (from sentence-transformers) (10.4.0)\n","Requirement already satisfied: filelock in /usr/local/lib/python3.10/dist-packages (from huggingface-hub>=0.20.0->sentence-transformers) (3.16.1)\n","Requirement already satisfied: fsspec>=2023.5.0 in /usr/local/lib/python3.10/dist-packages (from huggingface-hub>=0.20.0->sentence-transformers) (2024.6.1)\n","Requirement already satisfied: packaging>=20.9 in /usr/local/lib/python3.10/dist-packages (from huggingface-hub>=0.20.0->sentence-transformers) (24.1)\n","Requirement already satisfied: pyyaml>=5.1 in /usr/local/lib/python3.10/dist-packages (from huggingface-hub>=0.20.0->sentence-transformers) (6.0.2)\n","Requirement already satisfied: requests in /usr/local/lib/python3.10/dist-packages (from huggingface-hub>=0.20.0->sentence-transformers) (2.32.3)\n","Requirement already satisfied: typing-extensions>=3.7.4.3 in /usr/local/lib/python3.10/dist-packages (from huggingface-hub>=0.20.0->sentence-transformers) (4.12.2)\n","Requirement already satisfied: networkx in /usr/local/lib/python3.10/dist-packages (from torch>=1.11.0->sentence-transformers) (3.4.2)\n","Requirement already satisfied: jinja2 in /usr/local/lib/python3.10/dist-packages (from torch>=1.11.0->sentence-transformers) (3.1.4)\n","Requirement already satisfied: sympy==1.13.1 in /usr/local/lib/python3.10/dist-packages (from torch>=1.11.0->sentence-transformers) (1.13.1)\n","Requirement already satisfied: mpmath<1.4,>=1.1.0 in /usr/local/lib/python3.10/dist-packages (from sympy==1.13.1->torch>=1.11.0->sentence-transformers) (1.3.0)\n","Requirement already satisfied: numpy>=1.17 in /usr/local/lib/python3.10/dist-packages (from transformers<5.0.0,>=4.41.0->sentence-transformers) (1.26.4)\n","Requirement already satisfied: regex!=2019.12.17 in /usr/local/lib/python3.10/dist-packages (from transformers<5.0.0,>=4.41.0->sentence-transformers) (2024.9.11)\n","Requirement already satisfied: safetensors>=0.4.1 in /usr/local/lib/python3.10/dist-packages (from transformers<5.0.0,>=4.41.0->sentence-transformers) (0.4.5)\n","Requirement already satisfied: tokenizers<0.20,>=0.19 in /usr/local/lib/python3.10/dist-packages (from transformers<5.0.0,>=4.41.0->sentence-transformers) (0.19.1)\n","Requirement already satisfied: joblib>=1.2.0 in /usr/local/lib/python3.10/dist-packages (from scikit-learn->sentence-transformers) (1.4.2)\n","Requirement already satisfied: threadpoolctl>=3.1.0 in /usr/local/lib/python3.10/dist-packages (from scikit-learn->sentence-transformers) (3.5.0)\n","Requirement already satisfied: MarkupSafe>=2.0 in /usr/local/lib/python3.10/dist-packages (from jinja2->torch>=1.11.0->sentence-transformers) (3.0.2)\n","Requirement already satisfied: charset-normalizer<4,>=2 in /usr/local/lib/python3.10/dist-packages (from requests->huggingface-hub>=0.20.0->sentence-transformers) (3.4.0)\n","Requirement already satisfied: idna<4,>=2.5 in /usr/local/lib/python3.10/dist-packages (from requests->huggingface-hub>=0.20.0->sentence-transformers) (3.10)\n","Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.10/dist-packages (from requests->huggingface-hub>=0.20.0->sentence-transformers) (2.2.3)\n","Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.10/dist-packages (from requests->huggingface-hub>=0.20.0->sentence-transformers) (2024.8.30)\n","Downloading sentence_transformers-3.2.1-py3-none-any.whl (255 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m255.8/255.8 kB\u001b[0m \u001b[31m2.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hInstalling collected packages: sentence-transformers\n","Successfully installed sentence-transformers-3.2.1\n"]}],"source":["pip install sentence-transformers"]},{"cell_type":"code","execution_count":5,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":6049,"status":"ok","timestamp":1729819665030,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"},"user_tz":-540},"id":"JM9HSYFob-wr","outputId":"7b74b884-5c47-4aef-8e58-5424e73714eb"},"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting neo4j\n","  Downloading neo4j-5.25.0-py3-none-any.whl.metadata (5.7 kB)\n","Requirement already satisfied: pytz in /usr/local/lib/python3.10/dist-packages (from neo4j) (2024.2)\n","Downloading neo4j-5.25.0-py3-none-any.whl (296 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m296.6/296.6 kB\u001b[0m \u001b[31m5.3 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hInstalling collected packages: neo4j\n","Successfully installed neo4j-5.25.0\n"]}],"source":["pip install neo4j"]},{"cell_type":"code","execution_count":6,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":10839,"status":"ok","timestamp":1729819675853,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"},"user_tz":-540},"id":"3ZBPv5IfNMWW","outputId":"e094bc3c-cd3b-4cb4-e741-73601d6d3db1"},"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting neo4j_genai\n","  Downloading neo4j_genai-0.6.0-py3-none-any.whl.metadata (9.6 kB)\n","Requirement already satisfied: eval-type-backport<0.3.0,>=0.2.0 in /usr/local/lib/python3.10/dist-packages (from neo4j_genai) (0.2.0)\n","Requirement already satisfied: neo4j<6.0.0,>=5.17.0 in /usr/local/lib/python3.10/dist-packages (from neo4j_genai) (5.25.0)\n","Requirement already satisfied: pydantic<3.0.0,>=2.6.3 in /usr/local/lib/python3.10/dist-packages (from neo4j_genai) (2.9.2)\n","Collecting pypdf<5.0.0,>=4.3.1 (from neo4j_genai)\n","  Downloading pypdf-4.3.1-py3-none-any.whl.metadata (7.4 kB)\n","Collecting types-mock<6.0.0.0,>=5.1.0.20240425 (from neo4j_genai)\n","  Downloading types_mock-5.1.0.20240425-py3-none-any.whl.metadata (1.5 kB)\n","Collecting types-requests<3.0.0.0,>=2.31.0.20240218 (from neo4j_genai)\n","  Downloading types_requests-2.32.0.20241016-py3-none-any.whl.metadata (1.9 kB)\n","Requirement already satisfied: pytz in /usr/local/lib/python3.10/dist-packages (from neo4j<6.0.0,>=5.17.0->neo4j_genai) (2024.2)\n","Requirement already satisfied: annotated-types>=0.6.0 in /usr/local/lib/python3.10/dist-packages (from pydantic<3.0.0,>=2.6.3->neo4j_genai) (0.7.0)\n","Requirement already satisfied: pydantic-core==2.23.4 in /usr/local/lib/python3.10/dist-packages (from pydantic<3.0.0,>=2.6.3->neo4j_genai) (2.23.4)\n","Requirement already satisfied: typing-extensions>=4.6.1 in /usr/local/lib/python3.10/dist-packages (from pydantic<3.0.0,>=2.6.3->neo4j_genai) (4.12.2)\n","Requirement already satisfied: urllib3>=2 in /usr/local/lib/python3.10/dist-packages (from types-requests<3.0.0.0,>=2.31.0.20240218->neo4j_genai) (2.2.3)\n","Downloading neo4j_genai-0.6.0-py3-none-any.whl (92 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m92.3/92.3 kB\u001b[0m \u001b[31m3.8 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading pypdf-4.3.1-py3-none-any.whl (295 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m295.8/295.8 kB\u001b[0m \u001b[31m12.2 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading types_mock-5.1.0.20240425-py3-none-any.whl (5.7 kB)\n","Downloading types_requests-2.32.0.20241016-py3-none-any.whl (15 kB)\n","Installing collected packages: types-requests, types-mock, pypdf, neo4j_genai\n","Successfully installed neo4j_genai-0.6.0 pypdf-4.3.1 types-mock-5.1.0.20240425 types-requests-2.32.0.20241016\n"]}],"source":["pip install neo4j_genai"]},{"cell_type":"code","execution_count":7,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":8953,"status":"ok","timestamp":1729819684801,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"},"user_tz":-540},"id":"aBgMz8CENXaN","outputId":"a79a523d-0f6d-4d88-b5c5-544f2aea80b9"},"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting openai\n","  Downloading openai-1.52.2-py3-none-any.whl.metadata (24 kB)\n","Requirement already satisfied: anyio<5,>=3.5.0 in /usr/local/lib/python3.10/dist-packages (from openai) (3.7.1)\n","Requirement already satisfied: distro<2,>=1.7.0 in /usr/lib/python3/dist-packages (from openai) (1.7.0)\n","Requirement already satisfied: httpx<1,>=0.23.0 in /usr/local/lib/python3.10/dist-packages (from openai) (0.27.2)\n","Collecting jiter<1,>=0.4.0 (from openai)\n","  Downloading jiter-0.6.1-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (5.2 kB)\n","Requirement already satisfied: pydantic<3,>=1.9.0 in /usr/local/lib/python3.10/dist-packages (from openai) (2.9.2)\n","Requirement already satisfied: sniffio in /usr/local/lib/python3.10/dist-packages (from openai) (1.3.1)\n","Requirement already satisfied: tqdm>4 in /usr/local/lib/python3.10/dist-packages (from openai) (4.66.5)\n","Requirement already satisfied: typing-extensions<5,>=4.11 in /usr/local/lib/python3.10/dist-packages (from openai) (4.12.2)\n","Requirement already satisfied: idna>=2.8 in /usr/local/lib/python3.10/dist-packages (from anyio<5,>=3.5.0->openai) (3.10)\n","Requirement already satisfied: exceptiongroup in /usr/local/lib/python3.10/dist-packages (from anyio<5,>=3.5.0->openai) (1.2.2)\n","Requirement already satisfied: certifi in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->openai) (2024.8.30)\n","Requirement already satisfied: httpcore==1.* in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->openai) (1.0.6)\n","Requirement already satisfied: h11<0.15,>=0.13 in /usr/local/lib/python3.10/dist-packages (from httpcore==1.*->httpx<1,>=0.23.0->openai) (0.14.0)\n","Requirement already satisfied: annotated-types>=0.6.0 in /usr/local/lib/python3.10/dist-packages (from pydantic<3,>=1.9.0->openai) (0.7.0)\n","Requirement already satisfied: pydantic-core==2.23.4 in /usr/local/lib/python3.10/dist-packages (from pydantic<3,>=1.9.0->openai) (2.23.4)\n","Downloading openai-1.52.2-py3-none-any.whl (386 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m386.9/386.9 kB\u001b[0m \u001b[31m9.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading jiter-0.6.1-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (325 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m325.2/325.2 kB\u001b[0m \u001b[31m19.2 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hInstalling collected packages: jiter, openai\n","Successfully installed jiter-0.6.1 openai-1.52.2\n"]}],"source":["pip install openai"]},{"cell_type":"code","execution_count":8,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":7852,"status":"ok","timestamp":1729819692640,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"},"user_tz":-540},"id":"QFXmm_sMFVKq","outputId":"c39b432c-b553-4c3d-c5ad-84e01901b6ef"},"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting langchain_huggingface\n","  Downloading langchain_huggingface-0.1.0-py3-none-any.whl.metadata (1.3 kB)\n","Requirement already satisfied: huggingface-hub>=0.23.0 in /usr/local/lib/python3.10/dist-packages (from langchain_huggingface) (0.24.7)\n","Requirement already satisfied: langchain-core<0.4,>=0.3.0 in /usr/local/lib/python3.10/dist-packages (from langchain_huggingface) (0.3.12)\n","Requirement already satisfied: sentence-transformers>=2.6.0 in /usr/local/lib/python3.10/dist-packages (from langchain_huggingface) (3.2.1)\n","Requirement already satisfied: tokenizers>=0.19.1 in /usr/local/lib/python3.10/dist-packages (from langchain_huggingface) (0.19.1)\n","Requirement already satisfied: transformers>=4.39.0 in /usr/local/lib/python3.10/dist-packages (from langchain_huggingface) (4.44.2)\n","Requirement already satisfied: filelock in /usr/local/lib/python3.10/dist-packages (from huggingface-hub>=0.23.0->langchain_huggingface) (3.16.1)\n","Requirement already satisfied: fsspec>=2023.5.0 in /usr/local/lib/python3.10/dist-packages (from huggingface-hub>=0.23.0->langchain_huggingface) (2024.6.1)\n","Requirement already satisfied: packaging>=20.9 in /usr/local/lib/python3.10/dist-packages (from huggingface-hub>=0.23.0->langchain_huggingface) (24.1)\n","Requirement already satisfied: pyyaml>=5.1 in /usr/local/lib/python3.10/dist-packages (from huggingface-hub>=0.23.0->langchain_huggingface) (6.0.2)\n","Requirement already satisfied: requests in /usr/local/lib/python3.10/dist-packages (from huggingface-hub>=0.23.0->langchain_huggingface) (2.32.3)\n","Requirement already satisfied: tqdm>=4.42.1 in /usr/local/lib/python3.10/dist-packages (from huggingface-hub>=0.23.0->langchain_huggingface) (4.66.5)\n","Requirement already satisfied: typing-extensions>=3.7.4.3 in /usr/local/lib/python3.10/dist-packages (from huggingface-hub>=0.23.0->langchain_huggingface) (4.12.2)\n","Requirement already satisfied: jsonpatch<2.0,>=1.33 in /usr/local/lib/python3.10/dist-packages (from langchain-core<0.4,>=0.3.0->langchain_huggingface) (1.33)\n","Requirement already satisfied: langsmith<0.2.0,>=0.1.125 in /usr/local/lib/python3.10/dist-packages (from langchain-core<0.4,>=0.3.0->langchain_huggingface) (0.1.137)\n","Requirement already satisfied: pydantic<3.0.0,>=2.5.2 in /usr/local/lib/python3.10/dist-packages (from langchain-core<0.4,>=0.3.0->langchain_huggingface) (2.9.2)\n","Requirement already satisfied: tenacity!=8.4.0,<10.0.0,>=8.1.0 in /usr/local/lib/python3.10/dist-packages (from langchain-core<0.4,>=0.3.0->langchain_huggingface) (9.0.0)\n","Requirement already satisfied: torch>=1.11.0 in /usr/local/lib/python3.10/dist-packages (from sentence-transformers>=2.6.0->langchain_huggingface) (2.5.0+cu121)\n","Requirement already satisfied: scikit-learn in /usr/local/lib/python3.10/dist-packages (from sentence-transformers>=2.6.0->langchain_huggingface) (1.5.2)\n","Requirement already satisfied: scipy in /usr/local/lib/python3.10/dist-packages (from sentence-transformers>=2.6.0->langchain_huggingface) (1.13.1)\n","Requirement already satisfied: Pillow in /usr/local/lib/python3.10/dist-packages (from sentence-transformers>=2.6.0->langchain_huggingface) (10.4.0)\n","Requirement already satisfied: numpy>=1.17 in /usr/local/lib/python3.10/dist-packages (from transformers>=4.39.0->langchain_huggingface) (1.26.4)\n","Requirement already satisfied: regex!=2019.12.17 in /usr/local/lib/python3.10/dist-packages (from transformers>=4.39.0->langchain_huggingface) (2024.9.11)\n","Requirement already satisfied: safetensors>=0.4.1 in /usr/local/lib/python3.10/dist-packages (from transformers>=4.39.0->langchain_huggingface) (0.4.5)\n","Requirement already satisfied: jsonpointer>=1.9 in /usr/local/lib/python3.10/dist-packages (from jsonpatch<2.0,>=1.33->langchain-core<0.4,>=0.3.0->langchain_huggingface) (3.0.0)\n","Requirement already satisfied: httpx<1,>=0.23.0 in /usr/local/lib/python3.10/dist-packages (from langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_huggingface) (0.27.2)\n","Requirement already satisfied: orjson<4.0.0,>=3.9.14 in /usr/local/lib/python3.10/dist-packages (from langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_huggingface) (3.10.10)\n","Requirement already satisfied: requests-toolbelt<2.0.0,>=1.0.0 in /usr/local/lib/python3.10/dist-packages (from langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_huggingface) (1.0.0)\n","Requirement already satisfied: annotated-types>=0.6.0 in /usr/local/lib/python3.10/dist-packages (from pydantic<3.0.0,>=2.5.2->langchain-core<0.4,>=0.3.0->langchain_huggingface) (0.7.0)\n","Requirement already satisfied: pydantic-core==2.23.4 in /usr/local/lib/python3.10/dist-packages (from pydantic<3.0.0,>=2.5.2->langchain-core<0.4,>=0.3.0->langchain_huggingface) (2.23.4)\n","Requirement already satisfied: charset-normalizer<4,>=2 in /usr/local/lib/python3.10/dist-packages (from requests->huggingface-hub>=0.23.0->langchain_huggingface) (3.4.0)\n","Requirement already satisfied: idna<4,>=2.5 in /usr/local/lib/python3.10/dist-packages (from requests->huggingface-hub>=0.23.0->langchain_huggingface) (3.10)\n","Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.10/dist-packages (from requests->huggingface-hub>=0.23.0->langchain_huggingface) (2.2.3)\n","Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.10/dist-packages (from requests->huggingface-hub>=0.23.0->langchain_huggingface) (2024.8.30)\n","Requirement already satisfied: networkx in /usr/local/lib/python3.10/dist-packages (from torch>=1.11.0->sentence-transformers>=2.6.0->langchain_huggingface) (3.4.2)\n","Requirement already satisfied: jinja2 in /usr/local/lib/python3.10/dist-packages (from torch>=1.11.0->sentence-transformers>=2.6.0->langchain_huggingface) (3.1.4)\n","Requirement already satisfied: sympy==1.13.1 in /usr/local/lib/python3.10/dist-packages (from torch>=1.11.0->sentence-transformers>=2.6.0->langchain_huggingface) (1.13.1)\n","Requirement already satisfied: mpmath<1.4,>=1.1.0 in /usr/local/lib/python3.10/dist-packages (from sympy==1.13.1->torch>=1.11.0->sentence-transformers>=2.6.0->langchain_huggingface) (1.3.0)\n","Requirement already satisfied: joblib>=1.2.0 in /usr/local/lib/python3.10/dist-packages (from scikit-learn->sentence-transformers>=2.6.0->langchain_huggingface) (1.4.2)\n","Requirement already satisfied: threadpoolctl>=3.1.0 in /usr/local/lib/python3.10/dist-packages (from scikit-learn->sentence-transformers>=2.6.0->langchain_huggingface) (3.5.0)\n","Requirement already satisfied: anyio in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_huggingface) (3.7.1)\n","Requirement already satisfied: httpcore==1.* in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_huggingface) (1.0.6)\n","Requirement already satisfied: sniffio in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_huggingface) (1.3.1)\n","Requirement already satisfied: h11<0.15,>=0.13 in /usr/local/lib/python3.10/dist-packages (from httpcore==1.*->httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_huggingface) (0.14.0)\n","Requirement already satisfied: MarkupSafe>=2.0 in /usr/local/lib/python3.10/dist-packages (from jinja2->torch>=1.11.0->sentence-transformers>=2.6.0->langchain_huggingface) (3.0.2)\n","Requirement already satisfied: exceptiongroup in /usr/local/lib/python3.10/dist-packages (from anyio->httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_huggingface) (1.2.2)\n","Downloading langchain_huggingface-0.1.0-py3-none-any.whl (20 kB)\n","Installing collected packages: langchain_huggingface\n","Successfully installed langchain_huggingface-0.1.0\n"]}],"source":["pip install langchain_huggingface"]},{"cell_type":"code","execution_count":9,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"bi-L9JCVPrRP","outputId":"305eecd1-b22c-4e1f-e872-f822f8ddeec7","executionInfo":{"status":"ok","timestamp":1729819700199,"user_tz":-540,"elapsed":7580,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting langchain_google_genai\n","  Downloading langchain_google_genai-2.0.1-py3-none-any.whl.metadata (3.9 kB)\n","Requirement already satisfied: google-generativeai<0.9.0,>=0.8.0 in /usr/local/lib/python3.10/dist-packages (from langchain_google_genai) (0.8.3)\n","Requirement already satisfied: langchain-core<0.4,>=0.3.0 in /usr/local/lib/python3.10/dist-packages (from langchain_google_genai) (0.3.12)\n","Requirement already satisfied: pydantic<3,>=2 in /usr/local/lib/python3.10/dist-packages (from langchain_google_genai) (2.9.2)\n","Requirement already satisfied: google-ai-generativelanguage==0.6.10 in /usr/local/lib/python3.10/dist-packages (from google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (0.6.10)\n","Requirement already satisfied: google-api-core in /usr/local/lib/python3.10/dist-packages (from google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (2.19.2)\n","Requirement already satisfied: google-api-python-client in /usr/local/lib/python3.10/dist-packages (from google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (2.137.0)\n","Requirement already satisfied: google-auth>=2.15.0 in /usr/local/lib/python3.10/dist-packages (from google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (2.27.0)\n","Requirement already satisfied: protobuf in /usr/local/lib/python3.10/dist-packages (from google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (3.20.3)\n","Requirement already satisfied: tqdm in /usr/local/lib/python3.10/dist-packages (from google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (4.66.5)\n","Requirement already satisfied: typing-extensions in /usr/local/lib/python3.10/dist-packages (from google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (4.12.2)\n","Requirement already satisfied: proto-plus<2.0.0dev,>=1.22.3 in /usr/local/lib/python3.10/dist-packages (from google-ai-generativelanguage==0.6.10->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (1.24.0)\n","Requirement already satisfied: PyYAML>=5.3 in /usr/local/lib/python3.10/dist-packages (from langchain-core<0.4,>=0.3.0->langchain_google_genai) (6.0.2)\n","Requirement already satisfied: jsonpatch<2.0,>=1.33 in /usr/local/lib/python3.10/dist-packages (from langchain-core<0.4,>=0.3.0->langchain_google_genai) (1.33)\n","Requirement already satisfied: langsmith<0.2.0,>=0.1.125 in /usr/local/lib/python3.10/dist-packages (from langchain-core<0.4,>=0.3.0->langchain_google_genai) (0.1.137)\n","Requirement already satisfied: packaging<25,>=23.2 in /usr/local/lib/python3.10/dist-packages (from langchain-core<0.4,>=0.3.0->langchain_google_genai) (24.1)\n","Requirement already satisfied: tenacity!=8.4.0,<10.0.0,>=8.1.0 in /usr/local/lib/python3.10/dist-packages (from langchain-core<0.4,>=0.3.0->langchain_google_genai) (9.0.0)\n","Requirement already satisfied: annotated-types>=0.6.0 in /usr/local/lib/python3.10/dist-packages (from pydantic<3,>=2->langchain_google_genai) (0.7.0)\n","Requirement already satisfied: pydantic-core==2.23.4 in /usr/local/lib/python3.10/dist-packages (from pydantic<3,>=2->langchain_google_genai) (2.23.4)\n","Requirement already satisfied: googleapis-common-protos<2.0.dev0,>=1.56.2 in /usr/local/lib/python3.10/dist-packages (from google-api-core->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (1.65.0)\n","Requirement already satisfied: requests<3.0.0.dev0,>=2.18.0 in /usr/local/lib/python3.10/dist-packages (from google-api-core->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (2.32.3)\n","Requirement already satisfied: cachetools<6.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from google-auth>=2.15.0->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (5.5.0)\n","Requirement already satisfied: pyasn1-modules>=0.2.1 in /usr/local/lib/python3.10/dist-packages (from google-auth>=2.15.0->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (0.4.1)\n","Requirement already satisfied: rsa<5,>=3.1.4 in /usr/local/lib/python3.10/dist-packages (from google-auth>=2.15.0->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (4.9)\n","Requirement already satisfied: jsonpointer>=1.9 in /usr/local/lib/python3.10/dist-packages (from jsonpatch<2.0,>=1.33->langchain-core<0.4,>=0.3.0->langchain_google_genai) (3.0.0)\n","Requirement already satisfied: httpx<1,>=0.23.0 in /usr/local/lib/python3.10/dist-packages (from langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_google_genai) (0.27.2)\n","Requirement already satisfied: orjson<4.0.0,>=3.9.14 in /usr/local/lib/python3.10/dist-packages (from langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_google_genai) (3.10.10)\n","Requirement already satisfied: requests-toolbelt<2.0.0,>=1.0.0 in /usr/local/lib/python3.10/dist-packages (from langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_google_genai) (1.0.0)\n","Requirement already satisfied: httplib2<1.dev0,>=0.19.0 in /usr/local/lib/python3.10/dist-packages (from google-api-python-client->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (0.22.0)\n","Requirement already satisfied: google-auth-httplib2<1.0.0,>=0.2.0 in /usr/local/lib/python3.10/dist-packages (from google-api-python-client->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (0.2.0)\n","Requirement already satisfied: uritemplate<5,>=3.0.1 in /usr/local/lib/python3.10/dist-packages (from google-api-python-client->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (4.1.1)\n","Requirement already satisfied: grpcio<2.0dev,>=1.33.2 in /usr/local/lib/python3.10/dist-packages (from google-api-core[grpc]!=2.0.*,!=2.1.*,!=2.10.*,!=2.2.*,!=2.3.*,!=2.4.*,!=2.5.*,!=2.6.*,!=2.7.*,!=2.8.*,!=2.9.*,<3.0.0dev,>=1.34.1->google-ai-generativelanguage==0.6.10->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (1.64.1)\n","Requirement already satisfied: grpcio-status<2.0.dev0,>=1.33.2 in /usr/local/lib/python3.10/dist-packages (from google-api-core[grpc]!=2.0.*,!=2.1.*,!=2.10.*,!=2.2.*,!=2.3.*,!=2.4.*,!=2.5.*,!=2.6.*,!=2.7.*,!=2.8.*,!=2.9.*,<3.0.0dev,>=1.34.1->google-ai-generativelanguage==0.6.10->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (1.48.2)\n","Requirement already satisfied: pyparsing!=3.0.0,!=3.0.1,!=3.0.2,!=3.0.3,<4,>=2.4.2 in /usr/local/lib/python3.10/dist-packages (from httplib2<1.dev0,>=0.19.0->google-api-python-client->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (3.2.0)\n","Requirement already satisfied: anyio in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_google_genai) (3.7.1)\n","Requirement already satisfied: certifi in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_google_genai) (2024.8.30)\n","Requirement already satisfied: httpcore==1.* in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_google_genai) (1.0.6)\n","Requirement already satisfied: idna in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_google_genai) (3.10)\n","Requirement already satisfied: sniffio in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_google_genai) (1.3.1)\n","Requirement already satisfied: h11<0.15,>=0.13 in /usr/local/lib/python3.10/dist-packages (from httpcore==1.*->httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_google_genai) (0.14.0)\n","Requirement already satisfied: pyasn1<0.7.0,>=0.4.6 in /usr/local/lib/python3.10/dist-packages (from pyasn1-modules>=0.2.1->google-auth>=2.15.0->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (0.6.1)\n","Requirement already satisfied: charset-normalizer<4,>=2 in /usr/local/lib/python3.10/dist-packages (from requests<3.0.0.dev0,>=2.18.0->google-api-core->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (3.4.0)\n","Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.10/dist-packages (from requests<3.0.0.dev0,>=2.18.0->google-api-core->google-generativeai<0.9.0,>=0.8.0->langchain_google_genai) (2.2.3)\n","Requirement already satisfied: exceptiongroup in /usr/local/lib/python3.10/dist-packages (from anyio->httpx<1,>=0.23.0->langsmith<0.2.0,>=0.1.125->langchain-core<0.4,>=0.3.0->langchain_google_genai) (1.2.2)\n","Downloading langchain_google_genai-2.0.1-py3-none-any.whl (40 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m40.4/40.4 kB\u001b[0m \u001b[31m2.0 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hInstalling collected packages: langchain_google_genai\n","Successfully installed langchain_google_genai-2.0.1\n"]}],"source":["pip install langchain_google_genai"]},{"cell_type":"code","execution_count":10,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ugJRqHA6OVJf","executionInfo":{"status":"ok","timestamp":1729819707574,"user_tz":-540,"elapsed":7384,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"f6fa3f8b-6825-4390-cf3f-88a6c7efc5da"},"outputs":[{"output_type":"stream","name":"stdout","text":["Requirement already satisfied: openai in /usr/local/lib/python3.10/dist-packages (1.52.2)\n","Requirement already satisfied: anyio<5,>=3.5.0 in /usr/local/lib/python3.10/dist-packages (from openai) (3.7.1)\n","Requirement already satisfied: distro<2,>=1.7.0 in /usr/lib/python3/dist-packages (from openai) (1.7.0)\n","Requirement already satisfied: httpx<1,>=0.23.0 in /usr/local/lib/python3.10/dist-packages (from openai) (0.27.2)\n","Requirement already satisfied: jiter<1,>=0.4.0 in /usr/local/lib/python3.10/dist-packages (from openai) (0.6.1)\n","Requirement already satisfied: pydantic<3,>=1.9.0 in /usr/local/lib/python3.10/dist-packages (from openai) (2.9.2)\n","Requirement already satisfied: sniffio in /usr/local/lib/python3.10/dist-packages (from openai) (1.3.1)\n","Requirement already satisfied: tqdm>4 in /usr/local/lib/python3.10/dist-packages (from openai) (4.66.5)\n","Requirement already satisfied: typing-extensions<5,>=4.11 in /usr/local/lib/python3.10/dist-packages (from openai) (4.12.2)\n","Requirement already satisfied: idna>=2.8 in /usr/local/lib/python3.10/dist-packages (from anyio<5,>=3.5.0->openai) (3.10)\n","Requirement already satisfied: exceptiongroup in /usr/local/lib/python3.10/dist-packages (from anyio<5,>=3.5.0->openai) (1.2.2)\n","Requirement already satisfied: certifi in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->openai) (2024.8.30)\n","Requirement already satisfied: httpcore==1.* in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->openai) (1.0.6)\n","Requirement already satisfied: h11<0.15,>=0.13 in /usr/local/lib/python3.10/dist-packages (from httpcore==1.*->httpx<1,>=0.23.0->openai) (0.14.0)\n","Requirement already satisfied: annotated-types>=0.6.0 in /usr/local/lib/python3.10/dist-packages (from pydantic<3,>=1.9.0->openai) (0.7.0)\n","Requirement already satisfied: pydantic-core==2.23.4 in /usr/local/lib/python3.10/dist-packages (from pydantic<3,>=1.9.0->openai) (2.23.4)\n"]}],"source":["pip install openai"]},{"cell_type":"code","execution_count":11,"metadata":{"id":"TJ34_b39Ppr5","executionInfo":{"status":"ok","timestamp":1729819719588,"user_tz":-540,"elapsed":12018,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"outputs":[],"source":["from llm_response.get_llm_model import get_llm_model\n","\n","llm = get_llm_model()"]},{"cell_type":"code","execution_count":12,"metadata":{"id":"tIf6SoOIeC23","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1729819732317,"user_tz":-540,"elapsed":12732,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"442ceac1-fd90-4338-c379-4ffb46a8770d"},"outputs":[{"output_type":"execute_result","data":{"text/plain":["True"]},"metadata":{},"execution_count":12}],"source":["from cypher_query.retrieval_query import retrievalQuery, retrievalQuery_v2\n","from dotenv import load_dotenv\n","from config import CONFIG\n","\n","from graphrag.get_embedding_model import get_embedding_model\n","from langchain_community.vectorstores.neo4j_vector import Neo4jVector\n","\n","load_dotenv()"]},{"cell_type":"code","execution_count":13,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":36},"id":"aBlN8FmwPn1j","executionInfo":{"status":"ok","timestamp":1729819732317,"user_tz":-540,"elapsed":27,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"629340a0-6090-409d-dd20-84fd5593d53c"},"outputs":[{"output_type":"execute_result","data":{"text/plain":["'bolt://43.201.102.234/:7687'"],"application/vnd.google.colaboratory.intrinsic+json":{"type":"string"}},"metadata":{},"execution_count":13}],"source":["os.getenv('NEO4J_URI')"]},{"cell_type":"code","source":["from cypher_query.retrieval_query import retrievalQuery, retrievalQuery_v2, retrievalQuery_v3"],"metadata":{"id":"vqDSMPFlCA_r","executionInfo":{"status":"ok","timestamp":1729819732318,"user_tz":-540,"elapsed":20,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":14,"outputs":[]},{"cell_type":"code","source":["from utils import graphdb_driver"],"metadata":{"id":"OaFBhQVhHT-P","executionInfo":{"status":"ok","timestamp":1729819733572,"user_tz":-540,"elapsed":1273,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":15,"outputs":[]},{"cell_type":"code","execution_count":16,"metadata":{"executionInfo":{"elapsed":80607,"status":"ok","timestamp":1729819814171,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"},"user_tz":-540},"id":"DnJZVX--dJMc","colab":{"base_uri":"https://localhost:8080/","height":449,"referenced_widgets":["e1ca9745c2944571ad2cd268dfc7d100","ac94228ffc17403ebe2ec459dc019de3","609504edcb4f4b25af6f9604727505c3","78759acca29b44808d84c8a175c00186","71c19d010fad4586bcf4b61d2fb42438","fb9ae4d2a503446fa5e457ee43c44b35","9c3934c8709f4717822af2f4c3705053","183cb9c444ea4b11a54836194ff3ffd3","505db43ff7aa46cca7b26210137a660d","22c05f129d88497cbb8aae9a371330a1","e2cef91185b74b318fb16b49fb53e842","6fcafa48536a422cbeddd7cadfd6221a","9c6259167d184a61bc82e6f05ed806fe","07d681c27cdb40bdbfa65a34ed744836","94581d6f046442ca92432c35a34f60fe","91816b0f3eaf4adc961d6c69a152c08f","ca04bcaf97c746c78665d130ad430c7c","5f7c3d49ee424d849b6c008dd1940788","822e7d7cad3f40288134386637f74135","ad2d7a4742d54596b6f01eeca3836d16","c5d91f1d133243e5915a404773dd9f14","a6674903e2484cd28a8f1f0f300ae37f","50330067e2fe43c4b75b0be53c841f14","d2086c728f294a99886c7ec6d17c3b6c","d4812378d60d471cb44731cf1be1bec3","3f1aa771bd5c43caa30fdc1973245fa7","b33db657a70049ee9e8374a2a49ffa46","201328884148492e9f6de89eafd2af8d","12a8214e2bd34e20a9e2d51bc6e8629b","6795a8d5f041476c9af19bc1bf8ceb8b","309587938d924eed8d93673569e5667f","095fc2f3d2654eacae17eab5471c61a6","9d3973a7434c47d69a27fbe950f4f432","9e08b421e4b94a5cafb4885e2728003a","5fae9f32748a4e82a1eb0884258b6096","21aa067f219945079d715e9165ede334","cb34a802e0fa4f81ad7259b915274153","10ab542e3fa747bf8fe8147b3d10dec8","6ed35507c15b461d8e2ca0f5a76b6f0a","68fb2e9e8bf14fc18ef37003def6dad0","ffc8a0c9b3c147b58e5c91a22002af82","61a94febd3c944449be598c4b01f870b","842039aad148493dbf824394efcb381b","0753d30386b342188db30d62ace9d6fe","2469ac1fc17f491b95ae20a91adf048d","49fd8d32c2da49c794beb090ddc03afb","a4b45510f8044cf182de85d4d0a48a73","6a5c0438464e449880dc8895e01e41bf","00a33b9e08d64be98dbfbcf265ab08a3","39242bcf39a44ab189a58500e2286ec4","71942b67a31a488c8370787815a2fc3e","56661f01960e4246b112eac507f1c558","a9344424851343d5bc5f3ed4bfe61090","d3cacbe65dea446d9acfd7101e2d01a6","56161a2fc4f04b8094ed66553acc1e09","e641e282073f4fe3aa26b7b8c33c4c5d","cf25d35d2ec541f184b6e4bda642c398","8ef739a541164fe7922cb7a1374608c8","3689aa2422994a3d97a6cf5bbea2e481","2c2187af3528432b812a269102f1c735","3c94c0a4753149eab30544c1e355d90a","84b649044d664535a7f43c38f16eaddc","771bf55d973d47dda3fc5a086b90b575","9fd0a31c76d24345ba2541b93c8ce1c5","3ada939170e3486690c4e3bf440a6ab9","c5dbd49354fa4349b9fc6a7a82ae5b14","eed44839649f4485a4153a29c47888fb","b1546441b43b4ee49b45bfe9a421e7cc","095def30e3554d9e849664a7723ca44d","068603a9b9fe4a679c65f5661e79de52","014fb06c21c24408a8b428e7708a1d0b","939d655f1eda49049ce549b7b24371ca","1c9d48204a324c1c85888d4375354f87","efe5dc99cbe744479cbf7d5af76fdaaf","4232492b146744eeb69ccc340b3e0d0f","b8fd2cf7b4394428abedb9695dbcdf28","1c2466b18f62413ab0dea63757f9b01b","b3aea39e65f9419d84cdecd90e32e996","98a0e94cf8e2415a9cb98b4d1c67cc41","6f31aee3bab448ae8bcada5ae3b855c8","fa80e912ce554ac59b6abf2266ebd6b7","4079eec0ff2349e18c35703822b522ab","95e1d36663924854ae8fef8106b7e3b8","8ac371cc0a5a4e53a1bf545f1b6f980a","e30f1d6e6d91410b849444be0b92b75d","319ea9b1f23c42af87c8c51b9fa488c8","180034515cbf4ba0944c08a72d194192","7da13d6765b94271bcd8c839201ef3f1","dcb88302935d4a2aa1bb4aac3bc41e2c","5126a65f6fab4a72a5716c7f6ee1daba","c83693c3bab543cb9b93af1ea85d5141","fe368ee203cd49608ea7a43a0f4d38a3","84a7571ab93a4878a218a66557c6604d","b332cb8446ed46fc85a86114f1c53947","1ea51d270ff14366adc638beaecd378c","7707ad787e6f41f7b2e2216d9f8e2324","663637c54fdf4e578e6286969a65519f","eb4e8ceb68e548aabbfafb269bcee67f","fe63c191c2494d87a532313f4edccfa2","b01b746e75c047179c3dd6b40d1b44da","9db41b75f42f4f53a19301d1f9ec4446","65aca284d8c44288908fd49e909fe87b","c595e2ff86534516ba4dec7c0c34ea42","e77b00cef7764909aeca49c7e052baaf","5dc5f48e3658493aa33571684fa676c3","d17fcd85ce4240dda2d0a6ccaad7c193","1cd43bcdd91547c98b9233e8b5dd7ed7","86dfb09326a6483fa603e07698c9b6ec","424ed253f7774743b5f65cc02f644c92","6c4a805d2be44d9ea8c8fd9921dc6aec"]},"outputId":"5cbf0171-8ddb-4868-f1b7-ad478b6b3cec"},"outputs":[{"output_type":"stream","name":"stderr","text":["/usr/local/lib/python3.10/dist-packages/huggingface_hub/utils/_token.py:89: UserWarning: \n","The secret `HF_TOKEN` does not exist in your Colab secrets.\n","To authenticate with the Hugging Face Hub, create a token in your settings tab (https://huggingface.co/settings/tokens), set it as secret in your Google Colab and restart your session.\n","You will be able to reuse this secret in all of your notebooks.\n","Please note that authentication is recommended but still optional to access public models or datasets.\n","  warnings.warn(\n"]},{"output_type":"display_data","data":{"text/plain":["modules.json:   0%|          | 0.00/229 [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"e1ca9745c2944571ad2cd268dfc7d100"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["README.md:   0%|          | 0.00/10.2k [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"6fcafa48536a422cbeddd7cadfd6221a"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["sentence_bert_config.json:   0%|          | 0.00/53.0 [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"50330067e2fe43c4b75b0be53c841f14"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["config.json:   0%|          | 0.00/664 [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"9e08b421e4b94a5cafb4885e2728003a"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["model.safetensors:   0%|          | 0.00/2.27G [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"2469ac1fc17f491b95ae20a91adf048d"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["tokenizer_config.json:   0%|          | 0.00/1.17k [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"e641e282073f4fe3aa26b7b8c33c4c5d"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["sentencepiece.bpe.model:   0%|          | 0.00/5.07M [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"eed44839649f4485a4153a29c47888fb"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["tokenizer.json:   0%|          | 0.00/17.1M [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"b3aea39e65f9419d84cdecd90e32e996"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["special_tokens_map.json:   0%|          | 0.00/964 [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"dcb88302935d4a2aa1bb4aac3bc41e2c"}},"metadata":{}},{"output_type":"display_data","data":{"text/plain":["1_Pooling/config.json:   0%|          | 0.00/297 [00:00<?, ?B/s]"],"application/vnd.jupyter.widget-view+json":{"version_major":2,"version_minor":0,"model_id":"b01b746e75c047179c3dd6b40d1b44da"}},"metadata":{}}],"source":["def get_neo4j_vector(index_name='queryVector'):\n","    neo4jvector = Neo4jVector.from_existing_index(\n","        embedding=get_embedding_model(),  # Using the custom embedding function\n","        url=CONFIG.neo4j_url,\n","        database='neo4j',\n","        username=CONFIG.neo4j_user,\n","        password=CONFIG.neo4j_password,\n","        index_name=index_name,\n","        text_node_property=\"textEmbedding\",\n","        retrieval_query=retrievalQuery_v3\n","    )\n","    return neo4jvector\n","\n","def retrieve_store_nodes(query):\n","    \"\"\"\n","    쿼리 임베딩 <-> 리뷰 임베딩 유사도 측정하여 상위 n개의 Store 노드 추출\n","    \"\"\"\n","    store_retriever = get_neo4j_vector().as_retriever(search_kwargs={\"k\": 6})\n","    result_nodes = store_retriever.invoke(query)  # invoke는 동기적으로 실행되는 메서드\n","    return result_nodes\n","\n","store_retriever = get_neo4j_vector().as_retriever(search_kwargs={\"k\": 5})\n","vs = get_neo4j_vector()"]},{"cell_type":"code","execution_count":17,"metadata":{"executionInfo":{"elapsed":33,"status":"ok","timestamp":1729819814172,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"},"user_tz":-540},"id":"ZdPUsfIZFvli"},"outputs":[],"source":["query = \"8살 아이 포함 3인 가족 가기 좋은 평균가격 3만원대 패밀리 레스토랑 추천\"\n","query = \"20대 후반 여자 또래 친구끼리 가기 좋은 카페 추천해줘\"\n","query = '8살 아이 포함 3인 가족 가기 좋은 평균가격 3만원대 패밀리 레스토랑 추천해줘'\n","query = \"제주 중문 근처에서 30대 혼자 여행객에게 적합한 1~2만원대 한식 메뉴를 제공하는 조용한 맛집을 추천해 주세요. 혼자 방문하기 편안한 곳이면 좋겠습니다.\""]},{"cell_type":"code","execution_count":18,"metadata":{"executionInfo":{"elapsed":3639,"status":"ok","timestamp":1729819817780,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"},"user_tz":-540},"id":"syNwQntVayQk"},"outputs":[],"source":["store_retriever_rev_emb = get_neo4j_vector().as_retriever(search_kwargs={\"k\": 10})"]},{"cell_type":"code","execution_count":19,"metadata":{"executionInfo":{"elapsed":1462,"status":"ok","timestamp":1729819819235,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"},"user_tz":-540},"id":"zu0jXhlyFfaj"},"outputs":[],"source":["rev_sim_result = store_retriever_rev_emb.invoke(query)"]},{"cell_type":"code","source":["rev_sim_result"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"qXjeWNwTmYRN","executionInfo":{"status":"ok","timestamp":1729819819238,"user_tz":-540,"elapsed":92,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"daeacbb8-fe75-4857-8199-6f36c71753f3"},"execution_count":20,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[Document(metadata={'storeName': '달팽이&버닝치즈', 'store_Image': {'kakao': 'https://t1.kakaocdn.net/thumb/T800x0.q50/?fname=http%3A%2F%2Ft1.daumcdn.net%2Flocalfiy%2Fsearchregister_48804019', 'google': 'https://lh5.googleusercontent.com/p/AF1QipMDwknG2q68vYbBWDxctewK-91tFtOrr92QDemS=w408-h306-k-no', 'naver': None}, 'reviewText': '제주도 중문 근처 청국장 한정식 단일 메뉴를 가진 유명한 식당. 맛있어요. 단백한 건강식 한끼로 추천해 드리고 싶은 식당입니다. 영업일, 영업시간 미리 확인하시고 방문하세요.', 'store_Rating': {'kakao': 5.0, 'google': '4.5', 'naver': None}, 'store_Addr': '제주 서귀포시 안덕면 창천리 153-56번지', 'reviewCount': {'kakao': 5, 'google': 161, 'naver': None}, 'store_Type': '양식', 'pk': 1404}, page_content='제주도 중문 근처 청국장 한정식 단일 메뉴를 가진 유명한 식당. 맛있어요. 단백한 건강식 한끼로 추천해 드리고 싶은 식당입니다. 영업일, 영업시간 미리 확인하시고 방문하세요.'),\n"," Document(metadata={'storeName': '달팽이&버닝치즈', 'store_Image': {'kakao': 'https://t1.kakaocdn.net/thumb/T800x0.q50/?fname=http%3A%2F%2Ft1.daumcdn.net%2Flocalfiy%2Fsearchregister_48804019', 'google': 'https://lh5.googleusercontent.com/p/AF1QipMDwknG2q68vYbBWDxctewK-91tFtOrr92QDemS=w408-h306-k-no', 'naver': None}, 'reviewText': '분위기도 좋고 너무 맛있었어요 :)\\n양도 많고 야채랑 고기 다 맛잇었습니당\\n치즈 종류도 다양하고여\\n들어가는 길에 민가가 많아서 당황스러울 수 있어여ㅋㅋㅋ\\n다음에 제주도 오면 꼭 방문할거에여!\\n별 오백개 드리고싶네여ㅠㅠ 오래오래 있어주세영 또 올게여', 'store_Rating': {'kakao': 5.0, 'google': '4.5', 'naver': None}, 'store_Addr': '제주 서귀포시 안덕면 창천리 153-56번지', 'reviewCount': {'kakao': 5, 'google': 161, 'naver': None}, 'store_Type': '양식', 'pk': 1404}, page_content='분위기도 좋고 너무 맛있었어요 :)\\n양도 많고 야채랑 고기 다 맛잇었습니당\\n치즈 종류도 다양하고여\\n들어가는 길에 민가가 많아서 당황스러울 수 있어여ㅋㅋㅋ\\n다음에 제주도 오면 꼭 방문할거에여!\\n별 오백개 드리고싶네여ㅠㅠ 오래오래 있어주세영 또 올게여'),\n"," Document(metadata={'storeName': '난산리식당', 'store_Image': {'kakao': 'https://t1.kakaocdn.net/thumb/T800x0.q50/?fname=http%3A%2F%2Ft1.kakaocdn.net%2Ffiy_reboot%2Fplace%2F3E7053412BDC47CEA0B42D8DF7AD2F13', 'google': 'https://lh5.googleusercontent.com/p/AF1QipNjPLhRUWzXOtmPnRk0dhr5gHCTO7VD6_kztYq3=w408-h306-k-no', 'naver': 'https://search.pstatic.net/common/?autoRotate=true&type=w560_sharpen&src=https%3A%2F%2Fldb-phinf.pstatic.net%2F20240104_228%2F17043632120773Jxyg_JPEG%2FAFFBB7A0-EEA5-44DF-9FCC-DDB283DC3F38.jpeg'}, 'reviewText': '런치로 갔고 코스 한시간 좀 넘게 걸림! 혼자가도 충분히 잘 즐길 수 있는 분위기, 제주도에 갔는데 저렴한 코스요리를 즐기고 싶다하면 런치로 가는거 추천 바로 맞은편에 카페도 있어서 굿굿', 'menu': '런치 1부 11시30분,2부 1시:38000, 디너 6시30분 당일예약 전화 필수:68000', 'store_Rating': {'kakao': 4.3, 'google': '4.5', 'naver': None}, 'wait_time': '{\"30분 이내\":1,\"10분 이내\":1,\"바로 입장\":95}', 'purpose': '여행, 데이트, 친목', 'viwit_with': '연인・배우자, 친구, 부모님', 'use_how': '{\"예약 후 이용\":97}', 'store_Addr': '제주 서귀포시 성산읍 난산리 1054-1번지', 'reviewCount': {'kakao': 48, 'google': 63, 'naver': None}, 'store_Type': '양식', 'pk': 1034}, page_content='런치로 갔고 코스 한시간 좀 넘게 걸림! 혼자가도 충분히 잘 즐길 수 있는 분위기, 제주도에 갔는데 저렴한 코스요리를 즐기고 싶다하면 런치로 가는거 추천 바로 맞은편에 카페도 있어서 굿굿'),\n"," Document(metadata={'storeName': '미스칠', 'store_Image': {'kakao': 'https://t1.kakaocdn.net/thumb/T800x0.q50/?fname=http%3A%2F%2Ft1.kakaocdn.net%2Fmystore%2F3D96D7B213C647149195962DB7051EEA', 'google': 'https://lh5.googleusercontent.com/p/AF1QipNedhLrMTgEyw5HxwQkxm80RWQc8pa3Q2rEV0Bu=w408-h306-k-no', 'naver': 'https://search.pstatic.net/common/?autoRotate=true&type=w560_sharpen&src=https%3A%2F%2Fldb-phinf.pstatic.net%2F20210128_103%2F1611843401822NiCst_JPEG%2FwSF5eXPFf_dnjcYNvh_29iOF.jpg'}, 'reviewText': '가성비있는 적당한 기사식당, 1인 2만원에 나 다양한 제주음식 먹을수있음. 가는길이라면 재방문의사있음', 'menu': '돔베정식:20000, 전복뚝배기:15000, 전복죽:15000, 성게미역국:10000, 고등어구이:15000, 옥돔구이:25000, 뚝배기 정식 1인 (2인부터 주문):25000, 미스칠 특선 1인(2인부터 주문):25000, 돌솥정식(2인 기본):20000, 갈치구이 정식(2인분 부터 주문가능):35000, 미스칠 갈치 한상차림:50000, 통갈치구이 (2인기준):80000, 돔베고기:20000, 전복돌솥밥:15000', 'store_Rating': {'kakao': 4.2, 'google': '4.2', 'naver': None}, 'wait_time': '{\"30분 이내\":2,\"10분 이내\":1,\"바로 입장\":75}', 'purpose': '여행, 데이트, 친목', 'viwit_with': '연인・배우자, 부모님, 친구', 'use_how': '{\"예약 없이 이용\":72,\"예약 후 이용\":6}', 'store_Addr': '제주 제주시 연동 2434번지', 'reviewCount': {'kakao': 135, 'google': 538, 'naver': None}, 'store_Type': '가정식', 'pk': 2878}, page_content='가성비있는 적당한 기사식당, 1인 2만원에 나 다양한 제주음식 먹을수있음. 가는길이라면 재방문의사있음'),\n"," Document(metadata={'storeName': '미스칠', 'store_Image': {'kakao': 'https://t1.kakaocdn.net/thumb/T800x0.q50/?fname=http%3A%2F%2Ft1.kakaocdn.net%2Fmystore%2F3D96D7B213C647149195962DB7051EEA', 'google': 'https://lh5.googleusercontent.com/p/AF1QipNedhLrMTgEyw5HxwQkxm80RWQc8pa3Q2rEV0Bu=w408-h306-k-no', 'naver': 'https://search.pstatic.net/common/?autoRotate=true&type=w560_sharpen&src=https%3A%2F%2Fldb-phinf.pstatic.net%2F20210128_103%2F1611843401822NiCst_JPEG%2FwSF5eXPFf_dnjcYNvh_29iOF.jpg'}, 'reviewText': '너무 맛있어요~ 종류도 다양하고 밑반찬(묵무침, 계란말이, 구운김, 낙지젓갈, 간장게장)도 다 맛있네요~~ 돌솥밥도 최고예요!!', 'menu': '돔베정식:20000, 전복뚝배기:15000, 전복죽:15000, 성게미역국:10000, 고등어구이:15000, 옥돔구이:25000, 뚝배기 정식 1인 (2인부터 주문):25000, 미스칠 특선 1인(2인부터 주문):25000, 돌솥정식(2인 기본):20000, 갈치구이 정식(2인분 부터 주문가능):35000, 미스칠 갈치 한상차림:50000, 통갈치구이 (2인기준):80000, 돔베고기:20000, 전복돌솥밥:15000', 'store_Rating': {'kakao': 4.2, 'google': '4.2', 'naver': None}, 'wait_time': '{\"30분 이내\":2,\"10분 이내\":1,\"바로 입장\":75}', 'purpose': '여행, 데이트, 친목', 'viwit_with': '연인・배우자, 부모님, 친구', 'use_how': '{\"예약 없이 이용\":72,\"예약 후 이용\":6}', 'store_Addr': '제주 제주시 연동 2434번지', 'reviewCount': {'kakao': 135, 'google': 538, 'naver': None}, 'store_Type': '가정식', 'pk': 2878}, page_content='너무 맛있어요~ 종류도 다양하고 밑반찬(묵무침, 계란말이, 구운김, 낙지젓갈, 간장게장)도 다 맛있네요~~ 돌솥밥도 최고예요!!'),\n"," Document(metadata={'storeName': '달팽이&버닝치즈', 'store_Image': {'kakao': 'https://t1.kakaocdn.net/thumb/T800x0.q50/?fname=http%3A%2F%2Ft1.daumcdn.net%2Flocalfiy%2Fsearchregister_48804019', 'google': 'https://lh5.googleusercontent.com/p/AF1QipMDwknG2q68vYbBWDxctewK-91tFtOrr92QDemS=w408-h306-k-no', 'naver': None}, 'reviewText': '석쇠구이와 청국장 1.2만원 단일메뉴였다.\\n건물 외관은 제주스러웠음.…', 'store_Rating': {'kakao': 5.0, 'google': '4.5', 'naver': None}, 'store_Addr': '제주 서귀포시 안덕면 창천리 153-56번지', 'reviewCount': {'kakao': 5, 'google': 161, 'naver': None}, 'store_Type': '양식', 'pk': 1404}, page_content='석쇠구이와 청국장 1.2만원 단일메뉴였다.\\n건물 외관은 제주스러웠음.…'),\n"," Document(metadata={'storeName': '옛날옛적에 꽃술', 'store_Image': {'kakao': 'https://t1.kakaocdn.net/thumb/T800x0.q50/?fname=http%3A%2F%2Ft1.kakaocdn.net%2Ffiy_reboot%2Fplace%2F3B8F41D4717240218A1FD1F7A02E4C43', 'google': 'https://lh5.googleusercontent.com/p/AF1QipMfRWLDgNbLzw8FrMjn6xH_zWAGZv2eURTsQVMh=w426-h240-k-no', 'naver': 'https://search.pstatic.net/common/?autoRotate=true&type=w560_sharpen&src=https%3A%2F%2Fldb-phinf.pstatic.net%2F20221201_282%2F1669898445890ufkAC_JPEG%2FIMG_5717.jpg'}, 'reviewText': '간단히 맥주마시기 좋음', 'menu': '', 'store_Rating': {'kakao': 1.0, 'google': '4.0', 'naver': None}, 'wait_time': '{\"바로 입장\":12}', 'purpose': '데이트, 여행, 친목', 'viwit_with': '연인・배우자, 친구, 지인・동료', 'use_how': '{\"예약 없이 이용\":12}', 'store_Addr': '제주 서귀포시 서귀동 418번지 2층', 'reviewCount': {'kakao': 1, 'google': 342, 'naver': None}, 'store_Type': '가정식', 'pk': 5456}, page_content='간단히 맥주마시기 좋음'),\n"," Document(metadata={'storeName': '옛날옛적에 꽃술', 'store_Image': {'kakao': 'https://t1.kakaocdn.net/thumb/T800x0.q50/?fname=http%3A%2F%2Ft1.kakaocdn.net%2Ffiy_reboot%2Fplace%2F3B8F41D4717240218A1FD1F7A02E4C43', 'google': 'https://lh5.googleusercontent.com/p/AF1QipMfRWLDgNbLzw8FrMjn6xH_zWAGZv2eURTsQVMh=w426-h240-k-no', 'naver': 'https://search.pstatic.net/common/?autoRotate=true&type=w560_sharpen&src=https%3A%2F%2Fldb-phinf.pstatic.net%2F20221201_282%2F1669898445890ufkAC_JPEG%2FIMG_5717.jpg'}, 'reviewText': '제주의 톡속음식 한정식 전문식당 인데 깨끗하고 직원들도친절  음식도 정갈하면서 고급스럽고 맛도좋아요 제주에오면 꼭한번 들러 맛도경험하고 대접도받는 그런시간 되보세요 추천합니다', 'menu': '', 'store_Rating': {'kakao': 1.0, 'google': '4.0', 'naver': None}, 'wait_time': '{\"바로 입장\":12}', 'purpose': '데이트, 여행, 친목', 'viwit_with': '연인・배우자, 친구, 지인・동료', 'use_how': '{\"예약 없이 이용\":12}', 'store_Addr': '제주 서귀포시 서귀동 418번지 2층', 'reviewCount': {'kakao': 1, 'google': 342, 'naver': None}, 'store_Type': '가정식', 'pk': 5456}, page_content='제주의 톡속음식 한정식 전문식당 인데 깨끗하고 직원들도친절  음식도 정갈하면서 고급스럽고 맛도좋아요 제주에오면 꼭한번 들러 맛도경험하고 대접도받는 그런시간 되보세요 추천합니다'),\n"," Document(metadata={'storeName': '갱이네보말칼국수', 'store_Image': {'kakao': 'https://t1.kakaocdn.net/thumb/T800x0.q50/?fname=http%3A%2F%2Ft1.daumcdn.net%2Fplace%2F27BEB205CAF74DD2B060C1D28C86D59E', 'google': 'https://lh5.googleusercontent.com/p/AF1QipN8_d3IPg0IXwRcJTHihHBTRsA5EINdq_ftwIQg=w408-h306-k-no', 'naver': 'https://search.pstatic.net/common/?autoRotate=true&type=w560_sharpen&src=https%3A%2F%2Fldb-phinf.pstatic.net%2F20150901_174%2F1441073351003bDbWS_JPEG%2F33916867_0.jpeg'}, 'reviewText': '여긴 자꾸 소리지르는 남자사장 때문에 당골들 다떠나지', 'menu': '보말칼국수:13000, 접시고기:8000, 보말죽:12000', 'store_Rating': {'kakao': 2.5, 'google': '4.1', 'naver': 4.3}, 'wait_time': '{\"30분 이내\":3,\"10분 이내\":7,\"바로 입장\":28,\"30분 이상\":1}', 'purpose': '여행, 일상, 데이트', 'viwit_with': '연인・배우자, 지인・동료, 부모님', 'use_how': '{\"예약 없이 이용\":37,\"예약 후 이용\":2}', 'store_Addr': '제주 제주시 도남동 58-5번지', 'reviewCount': {'kakao': 119, 'google': 493, 'naver': 408}, 'store_Type': '단품요리 전문', 'pk': 313}, page_content='여긴 자꾸 소리지르는 남자사장 때문에 당골들 다떠나지'),\n"," Document(metadata={'storeName': '갱이네보말칼국수', 'store_Image': {'kakao': 'https://t1.kakaocdn.net/thumb/T800x0.q50/?fname=http%3A%2F%2Ft1.daumcdn.net%2Fplace%2F27BEB205CAF74DD2B060C1D28C86D59E', 'google': 'https://lh5.googleusercontent.com/p/AF1QipN8_d3IPg0IXwRcJTHihHBTRsA5EINdq_ftwIQg=w408-h306-k-no', 'naver': 'https://search.pstatic.net/common/?autoRotate=true&type=w560_sharpen&src=https%3A%2F%2Fldb-phinf.pstatic.net%2F20150901_174%2F1441073351003bDbWS_JPEG%2F33916867_0.jpeg'}, 'reviewText': '한적한 주택가에 자리 잡은 작은 식당~\\n청량고추넣은 보말칼국수 맛났어요.\\n조금 나오는 보말 죽도 부드럽고 속도 편하고~\\n제주와서 편하게 한끼 하고 싶다면 추천.', 'menu': '보말칼국수:13000, 접시고기:8000, 보말죽:12000', 'store_Rating': {'kakao': 2.5, 'google': '4.1', 'naver': 4.3}, 'wait_time': '{\"30분 이내\":3,\"10분 이내\":7,\"바로 입장\":28,\"30분 이상\":1}', 'purpose': '여행, 일상, 데이트', 'viwit_with': '연인・배우자, 지인・동료, 부모님', 'use_how': '{\"예약 없이 이용\":37,\"예약 후 이용\":2}', 'store_Addr': '제주 제주시 도남동 58-5번지', 'reviewCount': {'kakao': 119, 'google': 493, 'naver': 408}, 'store_Type': '단품요리 전문', 'pk': 313}, page_content='한적한 주택가에 자리 잡은 작은 식당~\\n청량고추넣은 보말칼국수 맛났어요.\\n조금 나오는 보말 죽도 부드럽고 속도 편하고~\\n제주와서 편하게 한끼 하고 싶다면 추천.')]"]},"metadata":{},"execution_count":20}]},{"cell_type":"code","source":["NEO4J_SCHEMA_RECOMM = \"\"\"Node properties:\n","STORE {\n","  MCT_NM: STRING. 가맹점명. ex) \"토평골식당\",\n","  ADDR: STRING. 가맹점 주소. ex) \"제주 서귀포시 토평동 1245-7번지\",\n","  MCT_TYPE: STRING. 요식관련 30개업종. values) '가정식', '단품요리 전문', '커피', '베이커리', '일식', '치킨', '중식', '분식', '햄버거', '양식', '맥주/요리주점', '아이스크림/빙수', '피자', '샌드위치/토스트', '차', '꼬치구이', '기타세계요리', '구내식당/푸드코트', '떡/한과', '도시락', '도너츠', '주스', '동남아/인도음식', '패밀리 레스토랑', '기사식당', '야식', '스테이크', '포장마차', '부페', '민속주점'\n","  OP_YMD: STRING. 가맹점개설일자. ex)\"20050704\"\n","  purpose : STRING. 동행 유형 top 3. ex)\"일상, 데이트, 친목\", \"여행, 친목, 데이트\", \"친목, 여행\", \"가족모임, 친목\", \"여행, 데이트, 기념일\"\n","  menu : STRING. 메뉴. ex) \"전복 삼계탕:18000, 특전복 삼계탕:22000, 흑임자 전복 삼계탕:20000\"\n","}\n","MONTH {\n","  YM: STRING. 기준연월. ex) \"202306\"\n","  month: STRING. 월 이름. ex) \"June\"\n","}\n","Region {\n","  name: STRING. 지역명. ex) \"대포동\", \"서홍동\", \"대정읍\"\n","}\n","City {\n","  name: STRING. 도시명. ex) \"서귀포시\", \"제주시\"\n","}\n","ATTR {\n","    AREA_NM: STRING. 관광지 이름. ex) \"가세오름\", \"THE WE\", \"갑자기 히어로즈 벽화길\", \"감성을담다\"\n","    ADDR : STRING. 관광지 주소. ex) \"ADDR: 제주특별자치도 제주시 구좌읍 평대리 579-8\"\n","}\n","Review {\n","    text : STRING. ex) \"받아서 가성비좋게 잘먹었어요. 직원들 다 친절하신데 그 커플세트 판매하시려고 여러번 추천하시는게 좀 부담스러웠어요\"\n","}\n","Visit_with\n","{\n","    member : STRING, ex) \"부모님\", \"연인・배우자\", \"아이\", \"친구\", \"친척・형제\", \"지인・동료\", \"반려동물\", \"혼자\"\n","}\n","\n","Relationship properties:\n","USE {\n","  UE_CNT_GRP: 이용건수구간. 월별 이용건수를 6개 구간으로 집계 시, 해당 가맹점의 이용건수가 포함되는 분위수 구간. ex)'상위 10% 이하', '10~25%', '25~50%', '50~75%', '75~90%', '90% 초과(하위 10% 이하)'\n","  UE_AMT_GRP: 이용금액구간. 월별 이용금액을 6개 구간으로 집계 시, 해당 가맹점의 이용금액이 포함되는 분위수 구간. ex)'상위 10% 이하', '10~25%', '25~50%', '50~75%', '75~90%', '90% 초과(하위 10% 이하)'\n","  UE_AMT_PER_TRSN_GRP: 건당 평균 이용금액 구간. 월별 건당 평균 이용금액을 6개 구간으로 집계 시, 해당 가맹점의 건당 평균 이용금액이 포함되는 분위수 구간. ex)'상위 10% 이하', '10~25%', '25~50%', '50~75%', '75~90%', '90% 초과(하위 10% 이하)'\n","  MON_UE_CNT_RAT: 월요일 이용건수 비중. FLOAT. ex) 0.1262\n","  TUE_UE_CNT_RAT: 화요일 이용건수 비중. FLOAT. ex) 0.1262\n","  WED_UE_CNT_RAT: 수요일 이용건수 비중. FLOAT. ex) 0.1941\n","  THU_UE_CNT_RAT: 목요일 이용건수 비중. FLOAT. ex) 0.2233\n","  FRI_UE_CNT_RAT: 금요일 이용건수 비중. FLOAT. ex) 0.1553\n","  SAT_UE_CNT_RAT: 토요일 이용건수 비중. FLOAT. ex) 0.1747\n","  SUN_UE_CNT_RAT: 일요일 이용건수 비중. FLOAT. ex) 0.1818\n","\n","  # 시간대별\n","  HR_5_11_UE_CNT_RAT: 5시~11시 이용건수 비중. FLOAT. ex) 0.1650\n","  HR_12_13_UE_CNT_RAT: 12시~13시 이용건수 비중. FLOAT. ex) 0.5242\n","  HR_14_17_UE_CNT_RAT: 14시~17시 이용건수 비중. FLOAT. ex) 0.3107\n","  HR_18_22_UE_CNT_RAT: 18시~22시 이용건수 비중. FLOAT. ex) 0.0511\n","  HR_23_4_UE_CNT_RAT: 23시~4시 이용건수 비중. FLOAT. ex) 0.07313\n","\n","  # 현지인\n","  LOCAL_UE_CNT_RAT: 현지인 이용건수 비중. FLOAT. ex) 0.5843\n","\n","  # 성별\n","  RC_M12_MAL_CUS_CNT_RAT: 남성 이용건수 비중. FLOAT. ex) 0.634\n","  RC_M12_FME_CUS_CNT_RAT: 여성 이용건수 비중. FLOAT. ex) 0.366\n","\n","  # 연령대별\n","  RC_M12_AGE_UND_20_CUS_CNT_RAT: 20대 이하 이용건수 비중. FLOAT. ex) 0.066\n","  RC_M12_AGE_30_CUS_CNT_RAT: 30대 이용건수 비중. FLOAT. ex) 0.252\n","  RC_M12_AGE_40_CUS_CNT_RAT: 40대 이용건수 비중. FLOAT. ex) 0.398\n","  RC_M12_AGE_50_CUS_CNT_RAT: 50대 이용건수 비중. FLOAT. ex) 0.201\n","  RC_M12_AGE_OVR_60_CUS_CNT_RAT: 60대 이상 이용건수 비중. FLOAT. ex) 0.083\n","}\n","\n","The relationships:\n","(:City)-[:HAS_REGION]->(:Region)\n","(:REGION)-[:HAS_STORE]->(:STORE)\n","(:STORE)-[:USE]->(:MONTH)\n","(:Region)-[:HAS_ATTR]->(:ATTR)\n","(:STORE)-[:HAS_REVIEW]->(:Review)\n","(:Review)-[:HAS_VISIT_WITH]->(:Visit_with)\n","(:STORE)-[:HAS_VISIT_WITH]->(:Visit_with)\n","\"\"\""],"metadata":{"id":"3dxp8z6mHXSV","executionInfo":{"status":"ok","timestamp":1729819819239,"user_tz":-540,"elapsed":83,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":21,"outputs":[]},{"cell_type":"code","source":["EXAMPLES = [\n","    \"\"\"USER INPUT: '아침에 우진 해장국 오픈런 할 건데, 근처에 후식으로 디저트 먹으러 갈 카페 알려줘 QUERY: // 1. '우진 해장국'을 포함하는 가게를 찾고, 그 가게가 속한 지역을 찾음\n","MATCH (rg:Region)-[:HAS_STORE]->(s:STORE)\n","WHERE s.MCT_NM CONTAINS \"우진\" AND s.MCT_NM CONTAINS \"해장국\"\n","WITH rg, s.latitude AS uzLat, s.longitude AS uzLon\n","\n","// 2. 같은 지역에 있는 다른 디저트 가게를 찾음\n","MATCH (rg)-[:HAS_STORE]->(c:STORE)\n","WHERE c.MCT_TYPE IN ['커피', '베이커리', '차', '아이스크림/빙수']\n","AND NOT c.MCT_NM CONTAINS \"우진\"  // '우진 해장국'은 제외\n","\n","// 3. 우진 해장국과의 거리 계산\n","WITH c, uzLat, uzLon, c.latitude AS cafeLat, c.longitude AS cafeLon\n","\n","// 4. 거리 계산 및 결과 출력\n","RETURN c.pk AS pk, c.MCT_NM AS CafeName, c.ADDR AS Address, c.menu AS Menu,\n","       point.distance(point({latitude: uzLat, longitude: uzLon}), point({latitude: cafeLat, longitude: cafeLon})) AS dist\n","ORDER BY dist ASC\n","LIMIT 5\n","\"\"\",\n","    \"\"\"USER INPUT: 바다 보이는 횟집 추천해줘. 제주 신화월드 근처에 부모님 모시고 가기 좋은 집 추천해줘 QUERY: // 1. '신화'와 '월드' 두 단어를 모두 포함하는 관광지(ATTR) 찾기\n","MATCH (a:ATTR)\n","WHERE a.AREA_NM CONTAINS \"신화\" AND a.AREA_NM CONTAINS \"월드\"  // '신화'와 '월드'를 모두 포함하는 관광지 찾기\n","WITH a.latitude AS swLat, a.longitude AS swLon\n","\n","// 2. 신화월드 근처에 있는 일식 가게 찾기\n","MATCH (rg:Region)-[:HAS_STORE]->(c:STORE)-[:HAS_VISIT_WITH]->(v:Visit_with)\n","WHERE c.MCT_TYPE = '일식'  // 일식 필터\n","AND v.member CONTAINS \"부모님\"  // 부모님과 함께 방문한 기록이 있는 장소 필터\n","\n","// 3. 신화월드와의 거리 계산\n","WITH c, swLat, swLon, c.latitude AS storeLat, c.longitude AS storeLon\n","\n","// 4. 거리 계산 및 결과 출력 (Primary Key 추가)\n","RETURN c.pk AS pk, c.MCT_NM AS RestaurantName, c.ADDR AS Address, c.menu AS Menu,\n","       point.distance(point({latitude: swLat, longitude: swLon}), point({latitude: storeLat, longitude: storeLon})) AS Distance_in_meters_from_Jeju_Shinhwa_World\n","ORDER BY Distance_in_meters_from_Jeju_Shinhwa_World ASC\n","LIMIT 5\n","\"\"\",\n","    \"\"\"USER INPUT: 8살 아이 포함 3인 가족 가기 좋은 평균가격 3만원대 패밀리 레스토랑 추천해줘 QUERY: // 1. 패밀리 레스토랑 중에서 가격 정보를 필터링\n","MATCH (s:STORE)\n","WHERE s.MCT_TYPE = '패밀리 레스토랑'\n","// 정규식을 사용하여 메뉴에서 가격 추출 (예: 30000~39999 범위의 가격)\n","AND ANY(menuItem IN split(s.menu, \", \")\n","        WHERE toInteger(apoc.text.regreplace(menuItem, \".*:(\\\\d+)\", \"$1\")) >= 30000\n","        AND toInteger(apoc.text.regreplace(menuItem, \".*:(\\\\d+)\", \"$1\")) < 40000)\n","WITH s\n","\n","// 2. 아이와 함께 방문할 수 있는 곳 필터링\n","MATCH (s)-[:HAS_VISIT_WITH]->(v:Visit_with)\n","WHERE v.member CONTAINS '아이'\n","RETURN s.pk AS pk, s.MCT_NM AS RestaurantName, s.ADDR AS Address, s.menu AS Menu,\n","       s.MCT_TYPE AS RestaurantType, v.member AS VisitWith\n","LIMIT 5\n","\"\"\",\n","    \"\"\"USER INPUT: 제주 중문 근처에서 30대 혼자 여행객에게 적합한 1~2만원대 한식 메뉴를 제공하는 조용한 맛집을 추천해 주세요. 혼자 방문하기 편안한 곳이면 좋겠습니다 QUERY: // 1. '제주시' 또는 '서귀포시' 내에서 '중문'을 포함하는 지역 찾기\n","MATCH (c:City)-[:HAS_REGION]->(rg:Region)\n","WHERE rg.name CONTAINS \"중문\"\n","\n","// 2. 해당 지역 내에서 한식집 비슷한 STORE 찾기\n","MATCH (rg)-[:HAS_STORE]->(s:STORE)-[u:USE]->(m:MONTH)\n","WHERE s.MCT_TYPE = '가정식'\n","\n","// 3. 메뉴에서 가격 범위 필터링 (1만원 이상 2만원 미만)\n","AND ANY(menuItem IN split(s.menu, \", \")\n","        WHERE toInteger(apoc.text.regreplace(menuItem, \".*:(\\\\d+)\", \"$1\")) >= 10000\n","        AND toInteger(apoc.text.regreplace(menuItem, \".*:(\\\\d+)\", \"$1\")) < 20000)\n","\n","// 4. 혼자 방문하기 적합한 곳 필터링 (Visit_with의 여러 유형을 OR로 처리)\n","MATCH (s)-[:HAS_VISIT_WITH]->(v:Visit_with)\n","WHERE v.member CONTAINS '혼자'\n","\n","// 5. 30대 이용 비중을 기준으로 높은 순으로 정렬\n","WITH s, u.RC_M12_AGE_30_CUS_CNT_RAT AS Age30CustomerRatio, v.member AS VisitWith\n","ORDER BY Age30CustomerRatio DESC  // 30대 고객 비중이 높은 순으로 정렬\n","\n","// 6. 결과 출력 (pk 추가)\n","RETURN s.pk AS pk, s.MCT_NM AS RestaurantName, s.ADDR AS Address, s.menu AS Menu,\n","       VisitWith, Age30CustomerRatio\n","LIMIT 5\"\"\"]"],"metadata":{"id":"zz84MLdkHXJk","executionInfo":{"status":"ok","timestamp":1729819819239,"user_tz":-540,"elapsed":81,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":22,"outputs":[]},{"cell_type":"code","source":["EXAMPLES_COMBINED = '\\n'.join(EXAMPLES) if EXAMPLES else ''\n","\n","TEXT_TO_CYPHER_FOR_RECOMM_TEMPLATE = \"\"\"Task: Generate a Cypher statement for querying a Neo4j graph database from a user input.\n","\n","Schema:\n","{NEO4J_SCHEMA}\n","\n","Examples:\n","{EXAMPLES_COMBINED}\n","\n","Input:\n","{query}\n","\n","Never use any properties or relationships not included in the schema.\n","Never include triple backticks ```.\n","Add an appropriate LIMIT clause.\n","Do not use STORE.MCT_TYPE and Visit_with.name beyond the provided examples, and try to find the closest match.\n","\n","Cypher query:\"\"\""],"metadata":{"id":"gXBlQAi9HXFX","executionInfo":{"status":"ok","timestamp":1729819819239,"user_tz":-540,"elapsed":80,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":23,"outputs":[]},{"cell_type":"code","source":["print(TEXT_TO_CYPHER_FOR_RECOMM_TEMPLATE.format(\n","    NEO4J_SCHEMA=NEO4J_SCHEMA_RECOMM,\n","    EXAMPLES_COMBINED=EXAMPLES_COMBINED,\n","    query='70대 부모님과 함께 갈 수 있는 제주 동부 지역에서 4만원 이하의 한정식을 제공하는 레스토랑을 추천해 주세요. 부모님과 함께하기 편리한 곳이었으면 좋겠습니다'\n","    ))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"collapsed":true,"id":"Xivx2Qx6HW6F","executionInfo":{"status":"ok","timestamp":1729819819240,"user_tz":-540,"elapsed":80,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"6e24d9eb-c230-46e1-9116-d3fbbd76e0fc"},"execution_count":24,"outputs":[{"output_type":"stream","name":"stdout","text":["Task: Generate a Cypher statement for querying a Neo4j graph database from a user input.\n","\n","Schema:\n","Node properties:\n","STORE {\n","  MCT_NM: STRING. 가맹점명. ex) \"토평골식당\",\n","  ADDR: STRING. 가맹점 주소. ex) \"제주 서귀포시 토평동 1245-7번지\",\n","  MCT_TYPE: STRING. 요식관련 30개업종. values) '가정식', '단품요리 전문', '커피', '베이커리', '일식', '치킨', '중식', '분식', '햄버거', '양식', '맥주/요리주점', '아이스크림/빙수', '피자', '샌드위치/토스트', '차', '꼬치구이', '기타세계요리', '구내식당/푸드코트', '떡/한과', '도시락', '도너츠', '주스', '동남아/인도음식', '패밀리 레스토랑', '기사식당', '야식', '스테이크', '포장마차', '부페', '민속주점'\n","  OP_YMD: STRING. 가맹점개설일자. ex)\"20050704\"\n","  purpose : STRING. 동행 유형 top 3. ex)\"일상, 데이트, 친목\", \"여행, 친목, 데이트\", \"친목, 여행\", \"가족모임, 친목\", \"여행, 데이트, 기념일\"\n","  menu : STRING. 메뉴. ex) \"전복 삼계탕:18000, 특전복 삼계탕:22000, 흑임자 전복 삼계탕:20000\"\n","}\n","MONTH {\n","  YM: STRING. 기준연월. ex) \"202306\"\n","  month: STRING. 월 이름. ex) \"June\"\n","}\n","Region {\n","  name: STRING. 지역명. ex) \"대포동\", \"서홍동\", \"대정읍\"\n","}\n","City {\n","  name: STRING. 도시명. ex) \"서귀포시\", \"제주시\"\n","}\n","ATTR {\n","    AREA_NM: STRING. 관광지 이름. ex) \"가세오름\", \"THE WE\", \"갑자기 히어로즈 벽화길\", \"감성을담다\"\n","    ADDR : STRING. 관광지 주소. ex) \"ADDR: 제주특별자치도 제주시 구좌읍 평대리 579-8\"\n","}\n","Review {\n","    text : STRING. ex) \"받아서 가성비좋게 잘먹었어요. 직원들 다 친절하신데 그 커플세트 판매하시려고 여러번 추천하시는게 좀 부담스러웠어요\"\n","}\n","Visit_with\n","{\n","    member : STRING, ex) \"부모님\", \"연인・배우자\", \"아이\", \"친구\", \"친척・형제\", \"지인・동료\", \"반려동물\", \"혼자\"\n","}\n","\n","Relationship properties:\n","USE {\n","  UE_CNT_GRP: 이용건수구간. 월별 이용건수를 6개 구간으로 집계 시, 해당 가맹점의 이용건수가 포함되는 분위수 구간. ex)'상위 10% 이하', '10~25%', '25~50%', '50~75%', '75~90%', '90% 초과(하위 10% 이하)'\n","  UE_AMT_GRP: 이용금액구간. 월별 이용금액을 6개 구간으로 집계 시, 해당 가맹점의 이용금액이 포함되는 분위수 구간. ex)'상위 10% 이하', '10~25%', '25~50%', '50~75%', '75~90%', '90% 초과(하위 10% 이하)'\n","  UE_AMT_PER_TRSN_GRP: 건당 평균 이용금액 구간. 월별 건당 평균 이용금액을 6개 구간으로 집계 시, 해당 가맹점의 건당 평균 이용금액이 포함되는 분위수 구간. ex)'상위 10% 이하', '10~25%', '25~50%', '50~75%', '75~90%', '90% 초과(하위 10% 이하)'\n","  MON_UE_CNT_RAT: 월요일 이용건수 비중. FLOAT. ex) 0.1262\n","  TUE_UE_CNT_RAT: 화요일 이용건수 비중. FLOAT. ex) 0.1262\n","  WED_UE_CNT_RAT: 수요일 이용건수 비중. FLOAT. ex) 0.1941\n","  THU_UE_CNT_RAT: 목요일 이용건수 비중. FLOAT. ex) 0.2233\n","  FRI_UE_CNT_RAT: 금요일 이용건수 비중. FLOAT. ex) 0.1553\n","  SAT_UE_CNT_RAT: 토요일 이용건수 비중. FLOAT. ex) 0.1747\n","  SUN_UE_CNT_RAT: 일요일 이용건수 비중. FLOAT. ex) 0.1818\n","\n","  # 시간대별\n","  HR_5_11_UE_CNT_RAT: 5시~11시 이용건수 비중. FLOAT. ex) 0.1650\n","  HR_12_13_UE_CNT_RAT: 12시~13시 이용건수 비중. FLOAT. ex) 0.5242\n","  HR_14_17_UE_CNT_RAT: 14시~17시 이용건수 비중. FLOAT. ex) 0.3107\n","  HR_18_22_UE_CNT_RAT: 18시~22시 이용건수 비중. FLOAT. ex) 0.0511\n","  HR_23_4_UE_CNT_RAT: 23시~4시 이용건수 비중. FLOAT. ex) 0.07313\n","\n","  # 현지인\n","  LOCAL_UE_CNT_RAT: 현지인 이용건수 비중. FLOAT. ex) 0.5843\n","\n","  # 성별\n","  RC_M12_MAL_CUS_CNT_RAT: 남성 이용건수 비중. FLOAT. ex) 0.634\n","  RC_M12_FME_CUS_CNT_RAT: 여성 이용건수 비중. FLOAT. ex) 0.366\n","\n","  # 연령대별\n","  RC_M12_AGE_UND_20_CUS_CNT_RAT: 20대 이하 이용건수 비중. FLOAT. ex) 0.066\n","  RC_M12_AGE_30_CUS_CNT_RAT: 30대 이용건수 비중. FLOAT. ex) 0.252\n","  RC_M12_AGE_40_CUS_CNT_RAT: 40대 이용건수 비중. FLOAT. ex) 0.398\n","  RC_M12_AGE_50_CUS_CNT_RAT: 50대 이용건수 비중. FLOAT. ex) 0.201\n","  RC_M12_AGE_OVR_60_CUS_CNT_RAT: 60대 이상 이용건수 비중. FLOAT. ex) 0.083\n","}\n","\n","The relationships:\n","(:City)-[:HAS_REGION]->(:Region)\n","(:REGION)-[:HAS_STORE]->(:STORE)\n","(:STORE)-[:USE]->(:MONTH)\n","(:Region)-[:HAS_ATTR]->(:ATTR)\n","(:STORE)-[:HAS_REVIEW]->(:Review)\n","(:Review)-[:HAS_VISIT_WITH]->(:Visit_with)\n","(:STORE)-[:HAS_VISIT_WITH]->(:Visit_with)\n","\n","\n","Examples:\n","USER INPUT: '아침에 우진 해장국 오픈런 할 건데, 근처에 후식으로 디저트 먹으러 갈 카페 알려줘 QUERY: // 1. '우진 해장국'을 포함하는 가게를 찾고, 그 가게가 속한 지역을 찾음\n","MATCH (rg:Region)-[:HAS_STORE]->(s:STORE)\n","WHERE s.MCT_NM CONTAINS \"우진\" AND s.MCT_NM CONTAINS \"해장국\"\n","WITH rg, s.latitude AS uzLat, s.longitude AS uzLon\n","\n","// 2. 같은 지역에 있는 다른 디저트 가게를 찾음\n","MATCH (rg)-[:HAS_STORE]->(c:STORE)\n","WHERE c.MCT_TYPE IN ['커피', '베이커리', '차', '아이스크림/빙수'] \n","AND NOT c.MCT_NM CONTAINS \"우진\"  // '우진 해장국'은 제외\n","\n","// 3. 우진 해장국과의 거리 계산\n","WITH c, uzLat, uzLon, c.latitude AS cafeLat, c.longitude AS cafeLon\n","\n","// 4. 거리 계산 및 결과 출력\n","RETURN c.pk AS pk, c.MCT_NM AS CafeName, c.ADDR AS Address, c.menu AS Menu, \n","       point.distance(point({latitude: uzLat, longitude: uzLon}), point({latitude: cafeLat, longitude: cafeLon})) AS dist\n","ORDER BY dist ASC\n","LIMIT 5\n","\n","USER INPUT: 바다 보이는 횟집 추천해줘. 제주 신화월드 근처에 부모님 모시고 가기 좋은 집 추천해줘 QUERY: // 1. '신화'와 '월드' 두 단어를 모두 포함하는 관광지(ATTR) 찾기\n","MATCH (a:ATTR)\n","WHERE a.AREA_NM CONTAINS \"신화\" AND a.AREA_NM CONTAINS \"월드\"  // '신화'와 '월드'를 모두 포함하는 관광지 찾기\n","WITH a.latitude AS swLat, a.longitude AS swLon\n","\n","// 2. 신화월드 근처에 있는 일식 가게 찾기\n","MATCH (rg:Region)-[:HAS_STORE]->(c:STORE)-[:HAS_VISIT_WITH]->(v:Visit_with)\n","WHERE c.MCT_TYPE = '일식'  // 일식 필터\n","AND v.member CONTAINS \"부모님\"  // 부모님과 함께 방문한 기록이 있는 장소 필터\n","\n","// 3. 신화월드와의 거리 계산\n","WITH c, swLat, swLon, c.latitude AS storeLat, c.longitude AS storeLon\n","\n","// 4. 거리 계산 및 결과 출력 (Primary Key 추가)\n","RETURN c.pk AS pk, c.MCT_NM AS RestaurantName, c.ADDR AS Address, c.menu AS Menu, \n","       point.distance(point({latitude: swLat, longitude: swLon}), point({latitude: storeLat, longitude: storeLon})) AS Distance_in_meters_from_Jeju_Shinhwa_World\n","ORDER BY Distance_in_meters_from_Jeju_Shinhwa_World ASC\n","LIMIT 5\n","\n","USER INPUT: 8살 아이 포함 3인 가족 가기 좋은 평균가격 3만원대 패밀리 레스토랑 추천해줘 QUERY: // 1. 패밀리 레스토랑 중에서 가격 정보를 필터링\n","MATCH (s:STORE)\n","WHERE s.MCT_TYPE = '패밀리 레스토랑'\n","// 정규식을 사용하여 메뉴에서 가격 추출 (예: 30000~39999 범위의 가격)\n","AND ANY(menuItem IN split(s.menu, \", \") \n","        WHERE toInteger(apoc.text.regreplace(menuItem, \".*:(\\d+)\", \"$1\")) >= 30000 \n","        AND toInteger(apoc.text.regreplace(menuItem, \".*:(\\d+)\", \"$1\")) < 40000)\n","WITH s\n","\n","// 2. 아이와 함께 방문할 수 있는 곳 필터링\n","MATCH (s)-[:HAS_VISIT_WITH]->(v:Visit_with)\n","WHERE v.member CONTAINS '아이'\n","RETURN s.pk AS pk, s.MCT_NM AS RestaurantName, s.ADDR AS Address, s.menu AS Menu, \n","       s.MCT_TYPE AS RestaurantType, v.member AS VisitWith\n","LIMIT 5\n","\n","USER INPUT: 제주 중문 근처에서 30대 혼자 여행객에게 적합한 1~2만원대 한식 메뉴를 제공하는 조용한 맛집을 추천해 주세요. 혼자 방문하기 편안한 곳이면 좋겠습니다 QUERY: // 1. '제주시' 또는 '서귀포시' 내에서 '중문'을 포함하는 지역 찾기\n","MATCH (c:City)-[:HAS_REGION]->(rg:Region)\n","WHERE rg.name CONTAINS \"중문\"\n","\n","// 2. 해당 지역 내에서 한식집 비슷한 STORE 찾기\n","MATCH (rg)-[:HAS_STORE]->(s:STORE)-[u:USE]->(m:MONTH)\n","WHERE s.MCT_TYPE = '가정식'\n","\n","// 3. 메뉴에서 가격 범위 필터링 (1만원 이상 2만원 미만)\n","AND ANY(menuItem IN split(s.menu, \", \") \n","        WHERE toInteger(apoc.text.regreplace(menuItem, \".*:(\\d+)\", \"$1\")) >= 10000 \n","        AND toInteger(apoc.text.regreplace(menuItem, \".*:(\\d+)\", \"$1\")) < 20000)\n","\n","// 4. 혼자 방문하기 적합한 곳 필터링 (Visit_with의 여러 유형을 OR로 처리)\n","MATCH (s)-[:HAS_VISIT_WITH]->(v:Visit_with)\n","WHERE v.member CONTAINS '혼자'\n","\n","// 5. 30대 이용 비중을 기준으로 높은 순으로 정렬\n","WITH s, u.RC_M12_AGE_30_CUS_CNT_RAT AS Age30CustomerRatio, v.member AS VisitWith\n","ORDER BY Age30CustomerRatio DESC  // 30대 고객 비중이 높은 순으로 정렬\n","\n","// 6. 결과 출력 (pk 추가)\n","RETURN s.pk AS pk, s.MCT_NM AS RestaurantName, s.ADDR AS Address, s.menu AS Menu, \n","       VisitWith, Age30CustomerRatio\n","LIMIT 5\n","\n","Input:\n","70대 부모님과 함께 갈 수 있는 제주 동부 지역에서 4만원 이하의 한정식을 제공하는 레스토랑을 추천해 주세요. 부모님과 함께하기 편리한 곳이었으면 좋겠습니다\n","\n","Never use any properties or relationships not included in the schema.\n","Never include triple backticks ```.\n","Add an appropriate LIMIT clause.\n","Do not use STORE.MCT_TYPE and Visit_with.name beyond the provided examples, and try to find the closest match.\n","\n","Cypher query:\n"]}]},{"cell_type":"code","source":["query = '30대 부모와 8살 아이가 함께 갈 수 있는, 애월읍 근처의 2~3만원대 한식 메뉴를 제공하는 맛집을 추천해 주세요. 아이와 함께 방문하기 적합한 곳이면 좋겠어요'"],"metadata":{"id":"kkny3VU6uTKM","executionInfo":{"status":"ok","timestamp":1729819819241,"user_tz":-540,"elapsed":30,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":25,"outputs":[]},{"cell_type":"code","source":["    response = llm.invoke(\n","TEXT_TO_CYPHER_FOR_RECOMM_TEMPLATE.format(\n","    NEO4J_SCHEMA=NEO4J_SCHEMA_RECOMM,\n","    EXAMPLES_COMBINED=EXAMPLES_COMBINED,\n","    query=query\n","    )\n","            )"],"metadata":{"id":"_h4Eu6IOjv-n","executionInfo":{"status":"ok","timestamp":1729819820451,"user_tz":-540,"elapsed":1233,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":26,"outputs":[]},{"cell_type":"code","source":["response.usage_metadata['input_tokens']"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"vtVg8SPdmerv","executionInfo":{"status":"ok","timestamp":1729819820453,"user_tz":-540,"elapsed":23,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"4bd922a4-17c5-4b68-d800-762e34f76a27"},"execution_count":27,"outputs":[{"output_type":"execute_result","data":{"text/plain":["3568"]},"metadata":{},"execution_count":27}]},{"cell_type":"code","source":["print(response.content)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"uD71kDUdjv6I","executionInfo":{"status":"ok","timestamp":1729819820453,"user_tz":-540,"elapsed":19,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"c70ab1de-033d-4ddd-cac2-c93f60ea07fe"},"execution_count":28,"outputs":[{"output_type":"stream","name":"stdout","text":["```cypher\n","MATCH (c:City)-[:HAS_REGION]->(rg:Region)\n","WHERE rg.name CONTAINS \"애월읍\"\n","MATCH (rg)-[:HAS_STORE]->(s:STORE)\n","WHERE s.MCT_TYPE = '가정식'\n","AND ANY(menuItem IN split(s.menu, \", \") \n","        WHERE toInteger(apoc.text.regreplace(menuItem, \".*:(\\d+)\", \"$1\")) >= 20000 \n","        AND toInteger(apoc.text.regreplace(menuItem, \".*:(\\d+)\", \"$1\")) < 30000)\n","MATCH (s)-[:HAS_VISIT_WITH]->(v:Visit_with)\n","WHERE v.member CONTAINS '아이' OR v.member CONTAINS '부모님'\n","RETURN s.pk AS pk, s.MCT_NM AS RestaurantName, s.ADDR AS Address, s.menu AS Menu, v.member AS VisitWith\n","LIMIT 5\n","```\n"]}]},{"cell_type":"code","source":[],"metadata":{"id":"vMzbyPRwK8Ih","executionInfo":{"status":"ok","timestamp":1729819820453,"user_tz":-540,"elapsed":13,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":28,"outputs":[]},{"cell_type":"code","source":["cypher = response.content.replace('```', '').replace('cypher', '').strip()"],"metadata":{"id":"ItSl-OZFjv1J","executionInfo":{"status":"ok","timestamp":1729819820453,"user_tz":-540,"elapsed":11,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":29,"outputs":[]},{"cell_type":"code","source":["records, summary, keys = graphdb_driver.execute_query(cypher)"],"metadata":{"id":"RG9mtFjijvxV","executionInfo":{"status":"ok","timestamp":1729822673250,"user_tz":-540,"elapsed":353,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":46,"outputs":[]},{"cell_type":"code","source":["r['pk']"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"z3q-mhBjeIEt","executionInfo":{"status":"ok","timestamp":1729822758503,"user_tz":-540,"elapsed":342,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"0c9d5c36-dab9-40bc-dd45-f1efebe80ea8"},"execution_count":54,"outputs":[{"output_type":"execute_result","data":{"text/plain":["8741"]},"metadata":{},"execution_count":54}]},{"cell_type":"code","source":["[r['pk'] for d in records_drop_dup]"],"metadata":{"id":"2iz49IXkeR_V","executionInfo":{"status":"ok","timestamp":1729822795369,"user_tz":-540,"elapsed":340,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"65d5c046-fe06-4ef8-d782-27893e1acffa","colab":{"base_uri":"https://localhost:8080/"}},"execution_count":56,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[8741]"]},"metadata":{},"execution_count":56}]},{"cell_type":"code","source":["r['pk'] not in [r['pk'] for d in records_drop_dup]"],"metadata":{"id":"Vkg1diRnePeQ","executionInfo":{"status":"ok","timestamp":1729822784844,"user_tz":-540,"elapsed":368,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"a96e3001-df1f-4003-fac0-52e70a918384","colab":{"base_uri":"https://localhost:8080/"}},"execution_count":55,"outputs":[{"output_type":"execute_result","data":{"text/plain":["False"]},"metadata":{},"execution_count":55}]},{"cell_type":"code","source":["records_drop_dup = []\n","for r in records:\n","    if r['pk'] not in [d['pk'] for d in records_drop_dup]:\n","        records_drop_dup.append(r)"],"metadata":{"id":"3JPiwo6SNU8l","executionInfo":{"status":"ok","timestamp":1729822803317,"user_tz":-540,"elapsed":375,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":57,"outputs":[]},{"cell_type":"code","source":["records_drop_dup"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"qaROSahfd7Ei","executionInfo":{"status":"ok","timestamp":1729822804843,"user_tz":-540,"elapsed":330,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"d480c813-a8d7-48bc-9d72-aa5b1cb7c5f5"},"execution_count":58,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[<Record pk=6590 RestaurantName='전복죽일번가' Address='제주 제주시 애월읍 구엄리 1258-3번지 1층' Menu='전복죽 (25분 이상 소요 예약추천):15000, 전복구이:25000, 뿔소라회/찜:20000, 전복회:25000, 산낙지:20000, 우도땅콩/한라봉/청보리/좁쌀막걸리:5000, (겨울한정) 매생이굴칼국수/떡국:15000, 제주 통한치라면:15000, 돌솥톳밥정식/전복게우젓+매생이굴미역국:20000, 해산물모듬(대):60000, 해산물모듬(소):40000, 한치해물전:15000, 제주산 해녀가 잡은 성게알 150g:55000, 자연산 돌멍게:30000, 돌문어숙회(한 마리):30000' VisitWith='아이'>,\n"," <Record pk=7146 RestaurantName='제주훈도애월흑돼지' Address='제주 제주시 애월읍 애월리 2482-1번지 1층' Menu='훈도 점심한상 2인:52000, 훈도 점심한상 3인:74000, 훈도 점심한상 4인:96000, 훈도 흑돼지[흑목살,흑삼겹] 600G:66000, 찐 훈도흑돼지 [흑가브리살] 200g:24000, 찐 훈도흑돼지 [흑갈매기살] 200G:24000, 흑돼지 김치찌개:8000, 해물 된장찌개:8000, 계란찜:3000, 멜젓볶음밥:5000, 열무김치국수:7000' VisitWith='부모님'>,\n"," <Record pk=8741 RestaurantName='하가면114' Address='제주 제주시 애월읍 하가리 1091-2번지 1층' Menu='돔베고기 大:28000, 멸치국수:8000, 돔베고기 小:18000, 물만두:10000, 고사리육개장:9000, 돼지국밥:9000, 검은콩국수:11000, 냉국수:9000, 고기국수:9000, 고기비빔국수:9000' VisitWith='아이'>]"]},"metadata":{},"execution_count":58}]},{"cell_type":"code","source":["import time\n","\n","def retrieve_top_k_reviews(store_pk, query_embedding, driver, k=3):\n","    \"\"\"\n","    특정 STORE 노드에 연결된 리뷰 중 유사한 TOP-K 리뷰를 반환합니다.\n","    \"\"\"\n","    query = \"\"\"\n","    MATCH (s:STORE {pk: $store_pk})-[:HAS_REVIEW]->(r:Review)\n","    WHERE r.textEmbedding IS NOT NULL\n","    RETURN r.text AS text, gds.similarity.cosine(r.textEmbedding, $query_embedding) AS similarity\n","    ORDER BY similarity DESC\n","    LIMIT $k\n","    \"\"\"\n","    with driver.session() as session:\n","        start_time = time.time()\n","        result = session.run(query, store_pk=store_pk, query_embedding=query_embedding, k=k)\n","        end_time = time.time()\n","        return [{\"text\": record[\"text\"], \"similarity\": record[\"similarity\"]} for record in result]"],"metadata":{"id":"uXz3yiW2S6Wp","executionInfo":{"status":"ok","timestamp":1729820942638,"user_tz":-540,"elapsed":365,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":33,"outputs":[]},{"cell_type":"code","source":["records"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"gfbYbUjuddoi","executionInfo":{"status":"ok","timestamp":1729822580758,"user_tz":-540,"elapsed":371,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"8e6ed3cd-ee2d-428d-fb60-12c6ef79e22b"},"execution_count":45,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[<Record pk=6590 RestaurantName='전복죽일번가' Address='제주 제주시 애월읍 구엄리 1258-3번지 1층' Menu='전복죽 (25분 이상 소요 예약추천):15000, 전복구이:25000, 뿔소라회/찜:20000, 전복회:25000, 산낙지:20000, 우도땅콩/한라봉/청보리/좁쌀막걸리:5000, (겨울한정) 매생이굴칼국수/떡국:15000, 제주 통한치라면:15000, 돌솥톳밥정식/전복게우젓+매생이굴미역국:20000, 해산물모듬(대):60000, 해산물모듬(소):40000, 한치해물전:15000, 제주산 해녀가 잡은 성게알 150g:55000, 자연산 돌멍게:30000, 돌문어숙회(한 마리):30000' VisitWith='아이'>,\n"," <Record pk=6590 RestaurantName='전복죽일번가' Address='제주 제주시 애월읍 구엄리 1258-3번지 1층' Menu='전복죽 (25분 이상 소요 예약추천):15000, 전복구이:25000, 뿔소라회/찜:20000, 전복회:25000, 산낙지:20000, 우도땅콩/한라봉/청보리/좁쌀막걸리:5000, (겨울한정) 매생이굴칼국수/떡국:15000, 제주 통한치라면:15000, 돌솥톳밥정식/전복게우젓+매생이굴미역국:20000, 해산물모듬(대):60000, 해산물모듬(소):40000, 한치해물전:15000, 제주산 해녀가 잡은 성게알 150g:55000, 자연산 돌멍게:30000, 돌문어숙회(한 마리):30000' VisitWith='부모님'>,\n"," <Record pk=7146 RestaurantName='제주훈도애월흑돼지' Address='제주 제주시 애월읍 애월리 2482-1번지 1층' Menu='훈도 점심한상 2인:52000, 훈도 점심한상 3인:74000, 훈도 점심한상 4인:96000, 훈도 흑돼지[흑목살,흑삼겹] 600G:66000, 찐 훈도흑돼지 [흑가브리살] 200g:24000, 찐 훈도흑돼지 [흑갈매기살] 200G:24000, 흑돼지 김치찌개:8000, 해물 된장찌개:8000, 계란찜:3000, 멜젓볶음밥:5000, 열무김치국수:7000' VisitWith='부모님'>,\n"," <Record pk=7146 RestaurantName='제주훈도애월흑돼지' Address='제주 제주시 애월읍 애월리 2482-1번지 1층' Menu='훈도 점심한상 2인:52000, 훈도 점심한상 3인:74000, 훈도 점심한상 4인:96000, 훈도 흑돼지[흑목살,흑삼겹] 600G:66000, 찐 훈도흑돼지 [흑가브리살] 200g:24000, 찐 훈도흑돼지 [흑갈매기살] 200G:24000, 흑돼지 김치찌개:8000, 해물 된장찌개:8000, 계란찜:3000, 멜젓볶음밥:5000, 열무김치국수:7000' VisitWith='아이'>,\n"," <Record pk=8741 RestaurantName='하가면114' Address='제주 제주시 애월읍 하가리 1091-2번지 1층' Menu='돔베고기 大:28000, 멸치국수:8000, 돔베고기 小:18000, 물만두:10000, 고사리육개장:9000, 돼지국밥:9000, 검은콩국수:11000, 냉국수:9000, 고기국수:9000, 고기비빔국수:9000' VisitWith='아이'>]"]},"metadata":{},"execution_count":45}]},{"cell_type":"code","source":["pks = list({r['pk'] for r in records})"],"metadata":{"id":"1v6bdcdVadB7","executionInfo":{"status":"ok","timestamp":1729820964408,"user_tz":-540,"elapsed":352,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":34,"outputs":[]},{"cell_type":"code","source":["query = '70대 부모님과 함께 갈 수 있는 제주 동부 지역에서 4만원 이하의 한정식을 제공하는 레스토랑을 추천해 주세요. 부모님과 함께하기 편리한 곳이었으면 좋겠습니다'\n","embedding_model = get_embedding_model()\n","query_embedding = embedding_model.embed_query(query)"],"metadata":{"id":"2X8uy5IjcTA5","executionInfo":{"status":"ok","timestamp":1729822284670,"user_tz":-540,"elapsed":2931,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":39,"outputs":[]},{"cell_type":"code","source":["result = retrieve_top_k_reviews(6590, query_embedding, graphdb_driver, k=3)"],"metadata":{"id":"8sDG24fyabOY","executionInfo":{"status":"ok","timestamp":1729822367589,"user_tz":-540,"elapsed":343,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":43,"outputs":[]},{"cell_type":"code","source":["result"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"czimOmjdcqgh","executionInfo":{"status":"ok","timestamp":1729822374178,"user_tz":-540,"elapsed":334,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"cbcec3c5-bb32-4566-9697-6fc5336ec901"},"execution_count":44,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[]"]},"metadata":{},"execution_count":44}]},{"cell_type":"code","source":["records, summary, keys = graphdb_driver.execute_query(f\"\"\"MATCH (s:STORE) WHERE s.pk in {str(pks)} RETURN s\"\"\")"],"metadata":{"id":"MCbqmAShaukH","executionInfo":{"status":"ok","timestamp":1729789258210,"user_tz":-540,"elapsed":1099,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":111,"outputs":[]},{"cell_type":"code","source":["for r in records:\n","    print(f\"{r['s']['MCT_NM']}\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"O8_39ginbRd_","executionInfo":{"status":"ok","timestamp":1729789287168,"user_tz":-540,"elapsed":314,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"d56f5d57-13c1-4e94-be1d-46a4f67fca66"},"execution_count":113,"outputs":[{"output_type":"stream","name":"stdout","text":["제주훈도애월흑돼지\n","하가면114\n","전복죽일번가\n"]}]},{"cell_type":"code","source":["for r in records:\n","    break"],"metadata":{"id":"UAlua8RqcKdc","executionInfo":{"status":"ok","timestamp":1729788695846,"user_tz":-540,"elapsed":3,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":91,"outputs":[]},{"cell_type":"code","source":["r['s']['pk']"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"4NAFo-wTcMES","executionInfo":{"status":"ok","timestamp":1729788716578,"user_tz":-540,"elapsed":483,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"2eece6c2-e21f-48f0-f046-d23ca6d0ea43"},"execution_count":94,"outputs":[{"output_type":"execute_result","data":{"text/plain":["7146"]},"metadata":{},"execution_count":94}]},{"cell_type":"code","source":["def get_candidate_str_for_node(records, query_embedding, graphdb_driver, review_k):\n","    drop_dup = []\n","    for r in records:\n","        if r['s']['pk'] not in [r['s']['pk'] for d in drop_dup]:\n","            drop_dup.append(r['s'])\n","\n","    candidates_str = ''\n","    for d in drop_dup:\n","        # 가게명\n","        candidates_str += f\"가게명 : {d['MCT_NM']}\\n\"\n","        # pk\n","        candidates_str += f\"pk : {d['pk']}\\n\"\n","        # 리뷰\n","        reviews = retrieve_top_k_reviews(d['pk'], query_embedding, graphdb_driver, k=review_k)\n","        candidates_str += f\"리뷰 : {', '.join(reviews)}\\n\"\n","        # 평점\n","        ratings_lst = []\n","        for platform in ['naver', 'kakao', 'google']:\n","            if (platform in d.metadata['store_Rating']) and (d.metadata['store_Rating'][platform] is not None):\n","                pf_rating = d.metadata['store_Rating'][platform]\n","            else:\n","                continue\n","            if platform in d.metadata['reviewCount'] and (d.metadata['reviewCount'][platform] is not None):\n","                pf_rc = d.metadata['reviewCount'][platform]\n","            else:\n","                continue\n","            ratings_lst.append(f\"{platform} {pf_rating}({pf_rc}명)\")\n","        rating_str = ', '.join(ratings_lst)\n","        candidates_str += f\"평점 : {rating_str}\\n\"\n","        # 주소\n","        if 'store_Addr' in d.metadata:\n","            candidates_str += f\"주소 : {d.metadata['store_Addr']}\\n\"\n","        # 음식 유형\n","        if 'store_Type' in d.metadata:\n","            candidates_str += f\"음식 유형 : {d.metadata['store_Type']}\\n\"\n","        # 방문 목적 top 3\n","        if 'purpose' in d.metadata:\n","            candidates_str += f\"방문 목적 top 3 : {d.metadata['purpose']}\\n\"\n","        # 대기 시간 통계\n","        if 'wait_time' in d.metadata:\n","            wait_time_str = d.metadata['wait_time'].replace('{', '').replace('}', '').replace('\"', '')\n","            candidates_str += f\"대기 시간 통계 : {wait_time_str}\\n\"\n","        # 예약 필요 여부\n","        if 'use_how' in d.metadata:\n","            use_how_str = d.metadata['use_how'].replace('{', '').replace('}', '').replace('\"', '')\n","            candidates_str += f\"예약 필요 여부 통계 : {use_how_str}\\n\"\n","        # 메뉴\n","        if 'menu' in d.metadata:\n","            candidates_str += f\"메뉴 : {d.metadata['menu'][:100]}\\n\"\n","\n","        candidates_str += '\\n'\n","    return candidates_str"],"metadata":{"id":"WeLkBkWQbivP"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["reviews = retrieve_top_k_reviews(pk, query_embedding, graphdb_driver, k=3)"],"metadata":{"id":"yBwwfQMvdFBI"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["r_keys"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"x7AcJvOqfuRk","executionInfo":{"status":"ok","timestamp":1729789624352,"user_tz":-540,"elapsed":395,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"8148ba73-6742-4ffe-cf48-36ebe84cdc95"},"execution_count":120,"outputs":[{"output_type":"execute_result","data":{"text/plain":["['pk', 'RestaurantName', 'Address', 'Menu', 'VisitWith']"]},"metadata":{},"execution_count":120}]},{"cell_type":"code","source":["r['pk']"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"Z14auuDpfynR","executionInfo":{"status":"ok","timestamp":1729789648484,"user_tz":-540,"elapsed":450,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"e7b9a8fa-d41a-475a-87f3-e48299e54465"},"execution_count":122,"outputs":[{"output_type":"execute_result","data":{"text/plain":["8741"]},"metadata":{},"execution_count":122}]},{"cell_type":"code","source":["retrieve_top_k_reviews(r['pk'], query_embedding, graphdb_driver, k=3)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"_ieEuRFLf3Cr","executionInfo":{"status":"ok","timestamp":1729789659230,"user_tz":-540,"elapsed":468,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"8494a86c-3e8a-4c5b-97f0-2542ef2edab4"},"execution_count":123,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[]"]},"metadata":{},"execution_count":123}]},{"cell_type":"code","source":["embedding_model = get_embedding_model()\n","query_embedding = embedding_model.embed_query(query)\n","retrieve_top_k_reviews(6511, query_embedding, graphdb_driver, k=3)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"4aLU8AWEajXw","executionInfo":{"status":"ok","timestamp":1729821830163,"user_tz":-540,"elapsed":3924,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"b0db55fe-f44f-424c-baea-828994e07c5d"},"execution_count":36,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[]"]},"metadata":{},"execution_count":36}]},{"cell_type":"code","source":["retrieve_top_k_reviews(6590, query_embedding, graphdb_driver, k=3)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"AX8OshIxanYX","executionInfo":{"status":"ok","timestamp":1729821979851,"user_tz":-540,"elapsed":379,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"d0862af3-8363-41d6-a7f8-08a26b8a55ed"},"execution_count":37,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[]"]},"metadata":{},"execution_count":37}]},{"cell_type":"code","source":["embedding_model = get_embedding_model()\n","query_embedding = embedding_model.embed_query(query)\n","\n","for r in records:\n","    r_keys = r.keys()\n","    for key in r_keys:\n","        print(f\"{key} : {str(r[key])[:100]}\")\n","        if key == 'pk':\n","            reviews = retrieve_top_k_reviews(r[key], query_embedding, graphdb_driver, k=3)\n","            if reviews:\n","                reviews_lst = [f\"{ri}. {review['text'][:100]}\" for ri, review in enumerate(reviews, start=1)]\n","                print(f\"Reviews : {', '.join(reviews_lst)}\")\n","    print()\n"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"4WMqIjX2jvst","executionInfo":{"status":"ok","timestamp":1729789598001,"user_tz":-540,"elapsed":4021,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"88e4a4f9-a21f-4f00-e53a-087734583b85"},"execution_count":118,"outputs":[{"output_type":"stream","name":"stdout","text":["pk : 6590\n","RestaurantName : 전복죽일번가\n","Address : 제주 제주시 애월읍 구엄리 1258-3번지 1층\n","Menu : 전복죽 (25분 이상 소요 예약추천):15000, 전복구이:25000, 뿔소라회/찜:20000, 전복회:25000, 산낙지:20000, 우도땅콩/한라봉/청보리/좁쌀막걸리:5000,\n","VisitWith : 아이\n","\n","pk : 6590\n","RestaurantName : 전복죽일번가\n","Address : 제주 제주시 애월읍 구엄리 1258-3번지 1층\n","Menu : 전복죽 (25분 이상 소요 예약추천):15000, 전복구이:25000, 뿔소라회/찜:20000, 전복회:25000, 산낙지:20000, 우도땅콩/한라봉/청보리/좁쌀막걸리:5000,\n","VisitWith : 부모님\n","\n","pk : 7146\n","RestaurantName : 제주훈도애월흑돼지\n","Address : 제주 제주시 애월읍 애월리 2482-1번지 1층\n","Menu : 훈도 점심한상 2인:52000, 훈도 점심한상 3인:74000, 훈도 점심한상 4인:96000, 훈도 흑돼지[흑목살,흑삼겹] 600G:66000, 찐 훈도흑돼지 [흑가브리살] 20\n","VisitWith : 부모님\n","\n","pk : 7146\n","RestaurantName : 제주훈도애월흑돼지\n","Address : 제주 제주시 애월읍 애월리 2482-1번지 1층\n","Menu : 훈도 점심한상 2인:52000, 훈도 점심한상 3인:74000, 훈도 점심한상 4인:96000, 훈도 흑돼지[흑목살,흑삼겹] 600G:66000, 찐 훈도흑돼지 [흑가브리살] 20\n","VisitWith : 아이\n","\n","pk : 8741\n","RestaurantName : 하가면114\n","Address : 제주 제주시 애월읍 하가리 1091-2번지 1층\n","Menu : 돔베고기 大:28000, 멸치국수:8000, 돔베고기 小:18000, 물만두:10000, 고사리육개장:9000, 돼지국밥:9000, 검은콩국수:11000, 냉국수:9000, 고기국\n","VisitWith : 아이\n","\n"]}]},{"cell_type":"code","source":[],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"67Oxb0AeVBMg","executionInfo":{"status":"ok","timestamp":1729786820568,"user_tz":-540,"elapsed":382,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"958b05b9-f224-47f6-97d5-4a421d2fea13"},"execution_count":69,"outputs":[{"output_type":"execute_result","data":{"text/plain":["['1. 엄청 친절하세요! 덕분에 당충전 하고 갑니다!',\n"," '2. 표선가서 커피 마실거면 여기로 가면 됨. 어디 카페 들어가서 6000원 7000원내고 마실게 아니라.\\n1800원 아아 하나 사서 근처 선착장이나 해변쪽 정자에 앉아서 바람 맞으며 커피 한잔하면, 거기가 최고의 카페임.\\n직원분들도 친절함. \"감사합니다. 좋은 하루 보내세요~\" 인사하는데. 이런 말 한마디가 기분이 좋아지는거지.',\n"," '3. 사장님 친절하시구요.커피도 맛나요']"]},"metadata":{},"execution_count":69}]},{"cell_type":"code","source":[],"metadata":{"id":"obKnCLEWOXbe","executionInfo":{"status":"ok","timestamp":1729785759262,"user_tz":-540,"elapsed":447,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":56,"outputs":[]},{"cell_type":"code","source":["embedding_model = get_embedding_model()\n","query_embedding = embedding_model.embed_query(query)"],"metadata":{"id":"nGFowvcDQgjh","executionInfo":{"status":"ok","timestamp":1729785699164,"user_tz":-540,"elapsed":3859,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":53,"outputs":[]},{"cell_type":"code","source":["reviews = retrieve_top_k_reviews(8741, query_embedding, graphdb_driver, k=3)"],"metadata":{"id":"9LMqNW0YOeaQ","executionInfo":{"status":"ok","timestamp":1729789836516,"user_tz":-540,"elapsed":280,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}}},"execution_count":127,"outputs":[]},{"cell_type":"code","source":["reviews"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"MBKyAPkBRg2q","executionInfo":{"status":"ok","timestamp":1729785896229,"user_tz":-540,"elapsed":461,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"5982c3f8-9b17-418f-cbfa-40ff8b6dd042"},"execution_count":59,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{'text': '사장님 정말 친절하세요👍🏻👍🏻👍🏻\\n제주말차크림라떼& 쑥크림라떼맛있어요\\n크림이 엄청 풍부해요😋…',\n","  'similarity': 0.4588850836080689},\n"," {'text': '푸른 보리밭에 아기자기 소담한 인테리어도 멋지지만 깔끔한 티와 친절하신 사장님덕에 기분이 좋았습니다.',\n","  'similarity': 0.4588850836080689},\n"," {'text': '조용하고, 디저트 맛있고ㅎㅎ\\n차도 맛있어요!!  대중교통으로 찾아기긴 조금 불편하단것만 빼면 최고!!!',\n","  'similarity': 0.4452135573116544}]"]},"metadata":{},"execution_count":59}]},{"cell_type":"code","source":["graphdb_driver.execute_query(cypher)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"3GJ6y2bnjvji","executionInfo":{"status":"ok","timestamp":1729760485219,"user_tz":-540,"elapsed":10,"user":{"displayName":"KYEONGCHAN LEE","userId":"03106579917275952793"}},"outputId":"fa7af3d3-1a25-4345-db80-3cb69ee85a8b"},"execution_count":121,"outputs":[{"output_type":"stream","name":"stdout","text":["제주할망밥상 표선점\n","제주 서귀포시 표선면 표선리 1010-5번지 1층\n","할망밥상그날정식(모듬생선) 1인:15000\n","부모님\n"]}]}],"metadata":{"colab":{"provenance":[],"mount_file_id":"1Bs7Zh0TXGiJlt1v-gzYJwqAakRPE4f-F","authorship_tag":"ABX9TyN/RZxNFOWBkXPrwwtsCRgW"},"kernelspec":{"display_name":"Python 3","name":"python3"},"language_info":{"name":"python"},"widgets":{"application/vnd.jupyter.widget-state+json":{"e1ca9745c2944571ad2cd268dfc7d100":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_ac94228ffc17403ebe2ec459dc019de3","IPY_MODEL_609504edcb4f4b25af6f9604727505c3","IPY_MODEL_78759acca29b44808d84c8a175c00186"],"layout":"IPY_MODEL_71c19d010fad4586bcf4b61d2fb42438"}},"ac94228ffc17403ebe2ec459dc019de3":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_fb9ae4d2a503446fa5e457ee43c44b35","placeholder":"​","style":"IPY_MODEL_9c3934c8709f4717822af2f4c3705053","value":"modules.json: 100%"}},"609504edcb4f4b25af6f9604727505c3":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_183cb9c444ea4b11a54836194ff3ffd3","max":229,"min":0,"orientation":"horizontal","style":"IPY_MODEL_505db43ff7aa46cca7b26210137a660d","value":229}},"78759acca29b44808d84c8a175c00186":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_22c05f129d88497cbb8aae9a371330a1","placeholder":"​","style":"IPY_MODEL_e2cef91185b74b318fb16b49fb53e842","value":" 229/229 [00:00&lt;00:00, 9.43kB/s]"}},"71c19d010fad4586bcf4b61d2fb42438":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"fb9ae4d2a503446fa5e457ee43c44b35":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"9c3934c8709f4717822af2f4c3705053":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"183cb9c444ea4b11a54836194ff3ffd3":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"505db43ff7aa46cca7b26210137a660d":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"22c05f129d88497cbb8aae9a371330a1":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"e2cef91185b74b318fb16b49fb53e842":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"6fcafa48536a422cbeddd7cadfd6221a":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_9c6259167d184a61bc82e6f05ed806fe","IPY_MODEL_07d681c27cdb40bdbfa65a34ed744836","IPY_MODEL_94581d6f046442ca92432c35a34f60fe"],"layout":"IPY_MODEL_91816b0f3eaf4adc961d6c69a152c08f"}},"9c6259167d184a61bc82e6f05ed806fe":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_ca04bcaf97c746c78665d130ad430c7c","placeholder":"​","style":"IPY_MODEL_5f7c3d49ee424d849b6c008dd1940788","value":"README.md: 100%"}},"07d681c27cdb40bdbfa65a34ed744836":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_822e7d7cad3f40288134386637f74135","max":10200,"min":0,"orientation":"horizontal","style":"IPY_MODEL_ad2d7a4742d54596b6f01eeca3836d16","value":10200}},"94581d6f046442ca92432c35a34f60fe":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_c5d91f1d133243e5915a404773dd9f14","placeholder":"​","style":"IPY_MODEL_a6674903e2484cd28a8f1f0f300ae37f","value":" 10.2k/10.2k [00:00&lt;00:00, 401kB/s]"}},"91816b0f3eaf4adc961d6c69a152c08f":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"ca04bcaf97c746c78665d130ad430c7c":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"5f7c3d49ee424d849b6c008dd1940788":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"822e7d7cad3f40288134386637f74135":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"ad2d7a4742d54596b6f01eeca3836d16":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"c5d91f1d133243e5915a404773dd9f14":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"a6674903e2484cd28a8f1f0f300ae37f":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"50330067e2fe43c4b75b0be53c841f14":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_d2086c728f294a99886c7ec6d17c3b6c","IPY_MODEL_d4812378d60d471cb44731cf1be1bec3","IPY_MODEL_3f1aa771bd5c43caa30fdc1973245fa7"],"layout":"IPY_MODEL_b33db657a70049ee9e8374a2a49ffa46"}},"d2086c728f294a99886c7ec6d17c3b6c":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_201328884148492e9f6de89eafd2af8d","placeholder":"​","style":"IPY_MODEL_12a8214e2bd34e20a9e2d51bc6e8629b","value":"sentence_bert_config.json: 100%"}},"d4812378d60d471cb44731cf1be1bec3":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_6795a8d5f041476c9af19bc1bf8ceb8b","max":53,"min":0,"orientation":"horizontal","style":"IPY_MODEL_309587938d924eed8d93673569e5667f","value":53}},"3f1aa771bd5c43caa30fdc1973245fa7":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_095fc2f3d2654eacae17eab5471c61a6","placeholder":"​","style":"IPY_MODEL_9d3973a7434c47d69a27fbe950f4f432","value":" 53.0/53.0 [00:00&lt;00:00, 2.68kB/s]"}},"b33db657a70049ee9e8374a2a49ffa46":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"201328884148492e9f6de89eafd2af8d":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"12a8214e2bd34e20a9e2d51bc6e8629b":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"6795a8d5f041476c9af19bc1bf8ceb8b":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"309587938d924eed8d93673569e5667f":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"095fc2f3d2654eacae17eab5471c61a6":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"9d3973a7434c47d69a27fbe950f4f432":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"9e08b421e4b94a5cafb4885e2728003a":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_5fae9f32748a4e82a1eb0884258b6096","IPY_MODEL_21aa067f219945079d715e9165ede334","IPY_MODEL_cb34a802e0fa4f81ad7259b915274153"],"layout":"IPY_MODEL_10ab542e3fa747bf8fe8147b3d10dec8"}},"5fae9f32748a4e82a1eb0884258b6096":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_6ed35507c15b461d8e2ca0f5a76b6f0a","placeholder":"​","style":"IPY_MODEL_68fb2e9e8bf14fc18ef37003def6dad0","value":"config.json: 100%"}},"21aa067f219945079d715e9165ede334":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_ffc8a0c9b3c147b58e5c91a22002af82","max":664,"min":0,"orientation":"horizontal","style":"IPY_MODEL_61a94febd3c944449be598c4b01f870b","value":664}},"cb34a802e0fa4f81ad7259b915274153":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_842039aad148493dbf824394efcb381b","placeholder":"​","style":"IPY_MODEL_0753d30386b342188db30d62ace9d6fe","value":" 664/664 [00:00&lt;00:00, 30.2kB/s]"}},"10ab542e3fa747bf8fe8147b3d10dec8":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"6ed35507c15b461d8e2ca0f5a76b6f0a":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"68fb2e9e8bf14fc18ef37003def6dad0":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"ffc8a0c9b3c147b58e5c91a22002af82":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"61a94febd3c944449be598c4b01f870b":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"842039aad148493dbf824394efcb381b":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"0753d30386b342188db30d62ace9d6fe":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"2469ac1fc17f491b95ae20a91adf048d":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_49fd8d32c2da49c794beb090ddc03afb","IPY_MODEL_a4b45510f8044cf182de85d4d0a48a73","IPY_MODEL_6a5c0438464e449880dc8895e01e41bf"],"layout":"IPY_MODEL_00a33b9e08d64be98dbfbcf265ab08a3"}},"49fd8d32c2da49c794beb090ddc03afb":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_39242bcf39a44ab189a58500e2286ec4","placeholder":"​","style":"IPY_MODEL_71942b67a31a488c8370787815a2fc3e","value":"model.safetensors: 100%"}},"a4b45510f8044cf182de85d4d0a48a73":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_56661f01960e4246b112eac507f1c558","max":2271064456,"min":0,"orientation":"horizontal","style":"IPY_MODEL_a9344424851343d5bc5f3ed4bfe61090","value":2271064456}},"6a5c0438464e449880dc8895e01e41bf":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_d3cacbe65dea446d9acfd7101e2d01a6","placeholder":"​","style":"IPY_MODEL_56161a2fc4f04b8094ed66553acc1e09","value":" 2.27G/2.27G [00:54&lt;00:00, 42.3MB/s]"}},"00a33b9e08d64be98dbfbcf265ab08a3":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"39242bcf39a44ab189a58500e2286ec4":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"71942b67a31a488c8370787815a2fc3e":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"56661f01960e4246b112eac507f1c558":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"a9344424851343d5bc5f3ed4bfe61090":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"d3cacbe65dea446d9acfd7101e2d01a6":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"56161a2fc4f04b8094ed66553acc1e09":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"e641e282073f4fe3aa26b7b8c33c4c5d":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_cf25d35d2ec541f184b6e4bda642c398","IPY_MODEL_8ef739a541164fe7922cb7a1374608c8","IPY_MODEL_3689aa2422994a3d97a6cf5bbea2e481"],"layout":"IPY_MODEL_2c2187af3528432b812a269102f1c735"}},"cf25d35d2ec541f184b6e4bda642c398":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_3c94c0a4753149eab30544c1e355d90a","placeholder":"​","style":"IPY_MODEL_84b649044d664535a7f43c38f16eaddc","value":"tokenizer_config.json: 100%"}},"8ef739a541164fe7922cb7a1374608c8":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_771bf55d973d47dda3fc5a086b90b575","max":1172,"min":0,"orientation":"horizontal","style":"IPY_MODEL_9fd0a31c76d24345ba2541b93c8ce1c5","value":1172}},"3689aa2422994a3d97a6cf5bbea2e481":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_3ada939170e3486690c4e3bf440a6ab9","placeholder":"​","style":"IPY_MODEL_c5dbd49354fa4349b9fc6a7a82ae5b14","value":" 1.17k/1.17k [00:00&lt;00:00, 57.9kB/s]"}},"2c2187af3528432b812a269102f1c735":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"3c94c0a4753149eab30544c1e355d90a":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"84b649044d664535a7f43c38f16eaddc":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"771bf55d973d47dda3fc5a086b90b575":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"9fd0a31c76d24345ba2541b93c8ce1c5":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"3ada939170e3486690c4e3bf440a6ab9":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"c5dbd49354fa4349b9fc6a7a82ae5b14":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"eed44839649f4485a4153a29c47888fb":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_b1546441b43b4ee49b45bfe9a421e7cc","IPY_MODEL_095def30e3554d9e849664a7723ca44d","IPY_MODEL_068603a9b9fe4a679c65f5661e79de52"],"layout":"IPY_MODEL_014fb06c21c24408a8b428e7708a1d0b"}},"b1546441b43b4ee49b45bfe9a421e7cc":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_939d655f1eda49049ce549b7b24371ca","placeholder":"​","style":"IPY_MODEL_1c9d48204a324c1c85888d4375354f87","value":"sentencepiece.bpe.model: 100%"}},"095def30e3554d9e849664a7723ca44d":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_efe5dc99cbe744479cbf7d5af76fdaaf","max":5069051,"min":0,"orientation":"horizontal","style":"IPY_MODEL_4232492b146744eeb69ccc340b3e0d0f","value":5069051}},"068603a9b9fe4a679c65f5661e79de52":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_b8fd2cf7b4394428abedb9695dbcdf28","placeholder":"​","style":"IPY_MODEL_1c2466b18f62413ab0dea63757f9b01b","value":" 5.07M/5.07M [00:00&lt;00:00, 41.7MB/s]"}},"014fb06c21c24408a8b428e7708a1d0b":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"939d655f1eda49049ce549b7b24371ca":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"1c9d48204a324c1c85888d4375354f87":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"efe5dc99cbe744479cbf7d5af76fdaaf":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"4232492b146744eeb69ccc340b3e0d0f":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"b8fd2cf7b4394428abedb9695dbcdf28":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"1c2466b18f62413ab0dea63757f9b01b":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"b3aea39e65f9419d84cdecd90e32e996":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_98a0e94cf8e2415a9cb98b4d1c67cc41","IPY_MODEL_6f31aee3bab448ae8bcada5ae3b855c8","IPY_MODEL_fa80e912ce554ac59b6abf2266ebd6b7"],"layout":"IPY_MODEL_4079eec0ff2349e18c35703822b522ab"}},"98a0e94cf8e2415a9cb98b4d1c67cc41":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_95e1d36663924854ae8fef8106b7e3b8","placeholder":"​","style":"IPY_MODEL_8ac371cc0a5a4e53a1bf545f1b6f980a","value":"tokenizer.json: 100%"}},"6f31aee3bab448ae8bcada5ae3b855c8":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_e30f1d6e6d91410b849444be0b92b75d","max":17083052,"min":0,"orientation":"horizontal","style":"IPY_MODEL_319ea9b1f23c42af87c8c51b9fa488c8","value":17083052}},"fa80e912ce554ac59b6abf2266ebd6b7":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_180034515cbf4ba0944c08a72d194192","placeholder":"​","style":"IPY_MODEL_7da13d6765b94271bcd8c839201ef3f1","value":" 17.1M/17.1M [00:00&lt;00:00, 42.2MB/s]"}},"4079eec0ff2349e18c35703822b522ab":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"95e1d36663924854ae8fef8106b7e3b8":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"8ac371cc0a5a4e53a1bf545f1b6f980a":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"e30f1d6e6d91410b849444be0b92b75d":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"319ea9b1f23c42af87c8c51b9fa488c8":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"180034515cbf4ba0944c08a72d194192":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"7da13d6765b94271bcd8c839201ef3f1":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"dcb88302935d4a2aa1bb4aac3bc41e2c":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_5126a65f6fab4a72a5716c7f6ee1daba","IPY_MODEL_c83693c3bab543cb9b93af1ea85d5141","IPY_MODEL_fe368ee203cd49608ea7a43a0f4d38a3"],"layout":"IPY_MODEL_84a7571ab93a4878a218a66557c6604d"}},"5126a65f6fab4a72a5716c7f6ee1daba":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_b332cb8446ed46fc85a86114f1c53947","placeholder":"​","style":"IPY_MODEL_1ea51d270ff14366adc638beaecd378c","value":"special_tokens_map.json: 100%"}},"c83693c3bab543cb9b93af1ea85d5141":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_7707ad787e6f41f7b2e2216d9f8e2324","max":964,"min":0,"orientation":"horizontal","style":"IPY_MODEL_663637c54fdf4e578e6286969a65519f","value":964}},"fe368ee203cd49608ea7a43a0f4d38a3":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_eb4e8ceb68e548aabbfafb269bcee67f","placeholder":"​","style":"IPY_MODEL_fe63c191c2494d87a532313f4edccfa2","value":" 964/964 [00:00&lt;00:00, 63.7kB/s]"}},"84a7571ab93a4878a218a66557c6604d":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"b332cb8446ed46fc85a86114f1c53947":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"1ea51d270ff14366adc638beaecd378c":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"7707ad787e6f41f7b2e2216d9f8e2324":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"663637c54fdf4e578e6286969a65519f":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"eb4e8ceb68e548aabbfafb269bcee67f":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"fe63c191c2494d87a532313f4edccfa2":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"b01b746e75c047179c3dd6b40d1b44da":{"model_module":"@jupyter-widgets/controls","model_name":"HBoxModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HBoxModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HBoxView","box_style":"","children":["IPY_MODEL_9db41b75f42f4f53a19301d1f9ec4446","IPY_MODEL_65aca284d8c44288908fd49e909fe87b","IPY_MODEL_c595e2ff86534516ba4dec7c0c34ea42"],"layout":"IPY_MODEL_e77b00cef7764909aeca49c7e052baaf"}},"9db41b75f42f4f53a19301d1f9ec4446":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_5dc5f48e3658493aa33571684fa676c3","placeholder":"​","style":"IPY_MODEL_d17fcd85ce4240dda2d0a6ccaad7c193","value":"1_Pooling/config.json: 100%"}},"65aca284d8c44288908fd49e909fe87b":{"model_module":"@jupyter-widgets/controls","model_name":"FloatProgressModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"FloatProgressModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"ProgressView","bar_style":"success","description":"","description_tooltip":null,"layout":"IPY_MODEL_1cd43bcdd91547c98b9233e8b5dd7ed7","max":297,"min":0,"orientation":"horizontal","style":"IPY_MODEL_86dfb09326a6483fa603e07698c9b6ec","value":297}},"c595e2ff86534516ba4dec7c0c34ea42":{"model_module":"@jupyter-widgets/controls","model_name":"HTMLModel","model_module_version":"1.5.0","state":{"_dom_classes":[],"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"HTMLModel","_view_count":null,"_view_module":"@jupyter-widgets/controls","_view_module_version":"1.5.0","_view_name":"HTMLView","description":"","description_tooltip":null,"layout":"IPY_MODEL_424ed253f7774743b5f65cc02f644c92","placeholder":"​","style":"IPY_MODEL_6c4a805d2be44d9ea8c8fd9921dc6aec","value":" 297/297 [00:00&lt;00:00, 13.6kB/s]"}},"e77b00cef7764909aeca49c7e052baaf":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"5dc5f48e3658493aa33571684fa676c3":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"d17fcd85ce4240dda2d0a6ccaad7c193":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}},"1cd43bcdd91547c98b9233e8b5dd7ed7":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"86dfb09326a6483fa603e07698c9b6ec":{"model_module":"@jupyter-widgets/controls","model_name":"ProgressStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"ProgressStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","bar_color":null,"description_width":""}},"424ed253f7774743b5f65cc02f644c92":{"model_module":"@jupyter-widgets/base","model_name":"LayoutModel","model_module_version":"1.2.0","state":{"_model_module":"@jupyter-widgets/base","_model_module_version":"1.2.0","_model_name":"LayoutModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"LayoutView","align_content":null,"align_items":null,"align_self":null,"border":null,"bottom":null,"display":null,"flex":null,"flex_flow":null,"grid_area":null,"grid_auto_columns":null,"grid_auto_flow":null,"grid_auto_rows":null,"grid_column":null,"grid_gap":null,"grid_row":null,"grid_template_areas":null,"grid_template_columns":null,"grid_template_rows":null,"height":null,"justify_content":null,"justify_items":null,"left":null,"margin":null,"max_height":null,"max_width":null,"min_height":null,"min_width":null,"object_fit":null,"object_position":null,"order":null,"overflow":null,"overflow_x":null,"overflow_y":null,"padding":null,"right":null,"top":null,"visibility":null,"width":null}},"6c4a805d2be44d9ea8c8fd9921dc6aec":{"model_module":"@jupyter-widgets/controls","model_name":"DescriptionStyleModel","model_module_version":"1.5.0","state":{"_model_module":"@jupyter-widgets/controls","_model_module_version":"1.5.0","_model_name":"DescriptionStyleModel","_view_count":null,"_view_module":"@jupyter-widgets/base","_view_module_version":"1.2.0","_view_name":"StyleView","description_width":""}}}}},"nbformat":4,"nbformat_minor":0}